[
  "I would like a [mohawk] (haircut_style) at 1:30 pm",
  "I would like a mohawk at [1:30 pm] (time)",
  "I just need a [mohawk] (haircut_style) on monday at 1 pm",
  "I just need a mohawk on [monday] (dayofweek) at 1 pm",
  "I just need a mohawk on monday at [1 pm] (time)",
  "I need a [mohawk] (haircut_style) at 1:30 pm on monday",
  "I need a mohawk at [1:30 pm] (time) on monday",
  "I need a mohawk at 1:30 pm on [monday] (dayofweek)",
  "I am thinking about a [mohawk] (haircut_style). I would like to cut on monday at 1 O'clock",
  "I am thinking about a mohawk. I would like to cut on [monday] (dayofweek) at 1 O'clock",
  "I am thinking about a mohawk. I would like to cut on monday at [1 O'clock] (time)",
  "I am thinking about a [mohawk] (haircut_style). I would like to cut on monday at 1 O'clock",
  "I am thinking about a mohawk. I would like to cut on [monday] (dayofweek) at 1 O'clock",
  "I am thinking about a mohawk. I would like to cut on monday at [1 O'clock] (time)",
  "I am thinking about a [mohawk] (haircut_style). I would like to cut on monday at 1 O'clock",
  "I am thinking about a mohawk. I would like to cut on [monday] (dayofweek) at 1 O'clock",
  "I am thinking about a mohawk. I would like to cut on monday at [1 O'clock] (time)",
  "I will go with a [mohawk] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like monday at 1:30 pm",
  "I will go with a mohawk. My girlfriend really like that. Can we do it as soon as possible like [monday] (dayofweek) at 1:30 pm",
  "I will go with a mohawk. My girlfriend really like that. Can we do it as soon as possible like monday at [1:30 pm] (time)",
  "I will go with a [mohawk] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like monday at 1:30 pm",
  "I will go with a mohawk. My girlfriend really like that. Can we do it as soon as possible like [monday] (dayofweek) at 1:30 pm",
  "I will go with a mohawk. My girlfriend really like that. Can we do it as soon as possible like monday at [1:30 pm] (time)",
  "I will go with a [mohawk] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like monday at 1:30 pm",
  "I will go with a mohawk. My girlfriend really like that. Can we do it as soon as possible like [monday] (dayofweek) at 1:30 pm",
  "I will go with a mohawk. My girlfriend really like that. Can we do it as soon as possible like monday at [1:30 pm] (time)",
  "i am looking for something funny like a [mohawk] (haircut_style). Can we do it at 1 O'clock on monday.",
  "i am looking for something funny like a mohawk. Can we do it at [1 O'clock] (time) on monday.",
  "i am looking for something funny like a mohawk. Can we do it at 1 O'clock on [monday] (dayofweek).",
  "Hey, please create an appointment to cut my hair on [monday] (dayofweek) around 1 O'clock in the morning. I just need a mohawk",
  "Hey, please create an appointment to cut my hair on monday around [1 O'clock in the morning] (time). I just need a mohawk",
  "Hey, please create an appointment to cut my hair on monday around 1 O'clock in the morning. I just need a [mohawk] (haircut_style)",
  "my son needs a hair cut. He will be taking the usually cut, a [mohawk] (haircut_style). Same time as well, monday at 1 pm. If 1 pm is not available, i can do 3 pm",
  "my son needs a hair cut. He will be taking the usually cut, a mohawk. Same time as well, [monday] (dayofweek) at 1 pm. If 1 pm is not available, i can do 3 pm",
  "my son needs a hair cut. He will be taking the usually cut, a mohawk. Same time as well, monday at [1 pm] (time). If [1 pm] (time) is not available, i can do 3 pm",
  "my son needs a hair cut. He will be taking the usually cut, a mohawk. Same time as well, monday at 1 pm. If 1 pm is not available, i can do [3 pm] (time)",
  "Hey, I would to [mohawk] (haircut_style) the side on monday. Can you create an appointment for me please. I am free in the morning so 1 am to 2 am can work for me",
  "Hey, I would to mohawk the side on [monday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 1 am to 2 am can work for me",
  "Hey, I would to mohawk the side on monday. Can you create an appointment for me please. I am free in the [morning] (time) so 1 am to 2 am can work for me",
  "Hey, I would to mohawk the side on monday. Can you create an appointment for me please. I am free in the morning so 1 am to [2 am] (time) can work for me",
  "Hey, I would to mohawk the side on monday. Can you create an appointment for me please. I am free in the morning so [1 am] (time) to 2 am can work for me",
  "I need a [mohawk] (haircut_style) before monday. Anytime in the afternoon like 1:30 pm is good",
  "I need a mohawk before [monday] (dayofweek). Anytime in the afternoon like 1:30 pm is good",
  "I need a mohawk before monday. Anytime in the [afternoon] (time) like 1:30 pm is good",
  "I need a mohawk before monday. Anytime in the afternoon like [1:30 pm] (time) is good",
  "Please create an appointment next week [monday] (dayofweek) at 1 pm for me. I have to fix my mohawk and take a fade.",
  "Please create an appointment next week monday at [1 pm] (time) for me. I have to fix my mohawk and take a fade.",
  "Please create an appointment next week monday at 1 pm for me. I have to fix my [mohawk] (haircut_style) and take a fade.",
  "Please create an appointment next week monday at 1 pm for me. I have to fix my mohawk and take a [fade] (haircut_style).",
  "My son need a haircut at  [1 pm] (time) tomorrow. He will be taking the usual a mohawk",
  "My son need a haircut at  1 pm [tomorrow] (dayofweek). He will be taking the usual a mohawk",
  "My son need a haircut at  1 pm tomorrow. He will be taking the usual a [mohawk] (haircut_style)",
  "my hair needs to cut. When is the earliest i can have a [mohawk] (haircut_style). I am only available in the morning",
  "my hair needs to cut. When is the [earliest] (dayofweek) i can have a mohawk. I am only available in the morning",
  "my hair needs to cut. When is the earliest i can have a mohawk. I am only available in the [morning] (time)",
  "[Next week] (dayofweek) monday the 10 i need mohawk. Anytime is good for me, but I prefer the afternoon",
  "Next week [monday] (dayofweek) the 10 i need mohawk. Anytime is good for me, but I prefer the afternoon",
  "Next week monday the 10 i need [mohawk] (haircut_style). Anytime is good for me, but I prefer the afternoon",
  "Next week monday the 10 i need mohawk. Anytime is good for me, but I prefer the [afternoon] (time)",
  "Next week monday the 10 i need mohawk. [Anytime] (time) is good for me, but I prefer the afternoon",
  "[1 pm] (time) on monday is fine",
  "1 pm on [monday] (dayofweek) is fine",
  "I would like a [mohawk] (haircut_style) at 1:00 pm on monday",
  "I would like a mohawk at [1:00 pm] (time) on monday",
  "I would like a mohawk at 1:00 pm on [monday] (dayofweek)",
  "Please create an appointment next week [monday] (dayofweek) at 1 pm for me. I want to take a fade and a mohawk.",
  "Please create an appointment next week monday at [1 pm] (time) for me. I want to take a fade and a mohawk.",
  "Please create an appointment next week monday at 1 pm for me. I want to take a [fade] (haircut_style) and a mohawk.",
  "Please create an appointment next week monday at 1 pm for me. I want to take a fade and a [mohawk] (haircut_style).",
  "my hair needs a trim. When is the earliest i can have a [mohawk] (haircut_style). I am only available in the morning on monday",
  "my hair needs a trim. When is the earliest i can have a mohawk. I am only available in the morning on [monday] (dayofweek)",
  "I would like a [mohawk] (haircut_style) at 1 pm on monday",
  "I would like a mohawk at [1 pm] (time) on monday",
  "I would like a mohawk at 1 pm on [monday] (dayofweek)",
  "I just need a [mohawk] (haircut_style) on monday at 1 pm",
  "I just need a mohawk on [monday] (dayofweek) at 1 pm",
  "I just need a mohawk on monday at [1 pm] (time)",
  "My son need a haircut_style at  [1 pm] (time) tomorrow. He will be taking the usual mohawk on monday",
  "My son need a haircut_style at  1 pm tomorrow. He will be taking the usual [mohawk] (haircut_style) on monday",
  "My son need a haircut_style at  1 pm tomorrow. He will be taking the usual mohawk on [monday] (dayofweek)",
  "i want [mohawk] (haircut_style). monday is a good day to cut my hair at 1 pm",
  "i want mohawk. [monday] (dayofweek) is a good day to cut my hair at 1 pm",
  "i want mohawk. monday is a good day to cut my hair at [1 pm] (time)",
  "The day i want to cut my hair is [monday] (dayofweek). I need a mohawk at 1 pm",
  "The day i want to cut my hair is monday. I need a [mohawk] (haircut_style) at 1 pm",
  "The day i want to cut my hair is monday. I need a mohawk at [1 pm] (time)",
  "I am free [monday] (dayofweek) and i am looking for a haircut. I am thinking about a mohawk. The time i want to cut it is 1 pm",
  "I am free monday and i am looking for a haircut. I am thinking about a [mohawk] (haircut_style). The time i want to cut it is 1 pm",
  "I am free monday and i am looking for a haircut. I am thinking about a mohawk. The time i want to cut it is [1 pm] (time)",
  "[monday] (dayofweek) is a good day to cut my hair. I want a mohawk at 1 pm",
  "monday is a good day to cut my hair. I want a [mohawk] (haircut_style) at 1 pm",
  "monday is a good day to cut my hair. I want a mohawk at [1 pm] (time)",
  "Next week [monday] (dayofweek) i want to get a mohawk at 1 pm",
  "Next week monday i want to get a [mohawk] (haircut_style) at 1 pm",
  "Next week monday i want to get a mohawk at [1 pm] (time)",
  "On [monday] (dayofweek) 13. I want to get a mohawk at 1 pm",
  "On monday 13. I want to get a [mohawk] (haircut_style) at 1 pm",
  "On monday 13. I want to get a mohawk at [1 pm] (time)",
  "I will take a [mohawk] (haircut_style) monday at 1 pm",
  "I will take a mohawk [monday] (dayofweek) at 1 pm",
  "I will take a mohawk monday at [1 pm] (time)",
  "I am going to the barber on [monday] (dayofweek) at 1 pm for a mohawk",
  "I am going to the barber on monday at [1 pm] (time) for a mohawk",
  "I am going to the barber on monday at 1 pm for a [mohawk] (haircut_style)",
  "[monday] (dayofweek) coming is when i will take a mohawk. The time i am free is 1 pm",
  "monday coming is when i will take a [mohawk] (haircut_style). The time i am free is 1 pm",
  "monday coming is when i will take a mohawk. The time i am free is [1 pm] (time)",
  "[monday] (dayofweek) is a good day",
  "i would like a [mohawk] (haircut_style) hairstyle",
  "I am free on [monday] (dayofweek)",
  "[monday] (dayofweek) can work for me",
  "i need a [mohawk] (haircut_style) haircut",
  "I need a trim and a [mohawk] (haircut_style) tomorrow at 1 pm. If it's not available next monday in the afternoon around 1",
  "I need a trim and a mohawk tomorrow at [1 pm] (time). If it's not available next monday in the afternoon around 1",
  "I need a trim and a mohawk tomorrow at 1 pm. If it's not available next [monday] (dayofweek) in the afternoon around 1",
  "I need a trim and a mohawk tomorrow at 1 pm. If it's not available next monday in the [afternoon] (time) around 1",
  "Can you give me a [mohawk] (haircut_style) or slickback. I can go for monday or tuesday around 1 in the morning",
  "Can you give me a mohawk or [slickback] (haircut_style). I can go for monday or tuesday around 1 in the morning",
  "Can you give me a mohawk or slickback. I can go for [monday] (dayofweek) or tuesday around 1 in the morning",
  "Can you give me a mohawk or slickback. I can go for monday or [tuesday] (dayofweek) around 1 in the morning",
  "Can you give me a mohawk or slickback. I can go for monday or tuesday around 1 in the [morning] (time)",
  "I just want a [mohawk] (haircut_style), nothing too fancy. will tomorrow around 1 in the afternoon work",
  "I just want a mohawk, nothing too fancy. will [tomorrow] (dayofweek) around 1 in the afternoon work",
  "I just want a mohawk, nothing too fancy. will tomorrow around 1 in the [afternoon] (time) work",
  "i am looking for something different like a [mohawk] (haircut_style) or a slickback. Anytime around 1 O'clock is fine on monday.",
  "i am looking for something different like a mohawk or a [slickback] (haircut_style). Anytime around 1 O'clock is fine on monday.",
  "i am looking for something different like a mohawk or a slickback. Anytime around [1 O'clock] (time) is fine on monday.",
  "i am looking for something different like a mohawk or a slickback. Anytime around 1 O'clock is fine on [monday] (dayofweek).",
  "can i have a [mohawk] (haircut_style) on monday in the morning at 1 or 1 am?",
  "can i have a mohawk on [monday] (dayofweek) in the morning at 1 or 1 am?",
  "can i have a mohawk on monday in the [morning] (time) at 1 or 1 am?",
  "can i have a mohawk on monday in the morning at 1 or [1 am] (time)?",
  "Hey, I would a [mohawk] (haircut_style) on monday. Can you create an appointment for me please. I am free in the morning so 1 am to 2 am can work for me",
  "Hey, I would a mohawk on [monday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 1 am to 2 am can work for me",
  "Hey, I would a mohawk on monday. Can you create an appointment for me please. I am free in the morning so [1 am] (time) to 2 am can work for me",
  "Hey, I would a mohawk on monday. Can you create an appointment for me please. I am free in the morning so 1 am to [2 am] (time) can work for me",
  "I would like a [slickback] (haircut_style) at 2:30 pm",
  "I would like a slickback at [2:30 pm] (time)",
  "I just need a [slickback] (haircut_style) on tuesday at 2 pm",
  "I just need a slickback on [tuesday] (dayofweek) at 2 pm",
  "I just need a slickback on tuesday at [2 pm] (time)",
  "I need a [slickback] (haircut_style) at 2:30 pm on tuesday",
  "I need a slickback at [2:30 pm] (time) on tuesday",
  "I need a slickback at 2:30 pm on [tuesday] (dayofweek)",
  "I am thinking about a [slickback] (haircut_style). I would like to cut on tuesday at 2 O'clock",
  "I am thinking about a slickback. I would like to cut on [tuesday] (dayofweek) at 2 O'clock",
  "I am thinking about a slickback. I would like to cut on tuesday at [2 O'clock] (time)",
  "I am thinking about a [slickback] (haircut_style). I would like to cut on tuesday at 2 O'clock",
  "I am thinking about a slickback. I would like to cut on [tuesday] (dayofweek) at 2 O'clock",
  "I am thinking about a slickback. I would like to cut on tuesday at [2 O'clock] (time)",
  "I am thinking about a [slickback] (haircut_style). I would like to cut on tuesday at 2 O'clock",
  "I am thinking about a slickback. I would like to cut on [tuesday] (dayofweek) at 2 O'clock",
  "I am thinking about a slickback. I would like to cut on tuesday at [2 O'clock] (time)",
  "I will go with a [slickback] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like tuesday at 2:30 pm",
  "I will go with a slickback. My girlfriend really like that. Can we do it as soon as possible like [tuesday] (dayofweek) at 2:30 pm",
  "I will go with a slickback. My girlfriend really like that. Can we do it as soon as possible like tuesday at [2:30 pm] (time)",
  "I will go with a [slickback] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like tuesday at 2:30 pm",
  "I will go with a slickback. My girlfriend really like that. Can we do it as soon as possible like [tuesday] (dayofweek) at 2:30 pm",
  "I will go with a slickback. My girlfriend really like that. Can we do it as soon as possible like tuesday at [2:30 pm] (time)",
  "I will go with a [slickback] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like tuesday at 2:30 pm",
  "I will go with a slickback. My girlfriend really like that. Can we do it as soon as possible like [tuesday] (dayofweek) at 2:30 pm",
  "I will go with a slickback. My girlfriend really like that. Can we do it as soon as possible like tuesday at [2:30 pm] (time)",
  "i am looking for something funny like a [slickback] (haircut_style). Can we do it at 2 O'clock on tuesday.",
  "i am looking for something funny like a slickback. Can we do it at [2 O'clock] (time) on tuesday.",
  "i am looking for something funny like a slickback. Can we do it at 2 O'clock on [tuesday] (dayofweek).",
  "Hey, please create an appointment to cut my hair on [tuesday] (dayofweek) around 2 O'clock in the morning. I just need a slickback",
  "Hey, please create an appointment to cut my hair on tuesday around [2 O'clock in the morning] (time). I just need a slickback",
  "Hey, please create an appointment to cut my hair on tuesday around 2 O'clock in the morning. I just need a [slickback] (haircut_style)",
  "my son needs a hair cut. He will be taking the usually cut, a [slickback] (haircut_style). Same time as well, tuesday at 2 pm. If 2 pm is not available, i can do 2 pm",
  "my son needs a hair cut. He will be taking the usually cut, a slickback. Same time as well, [tuesday] (dayofweek) at 2 pm. If 2 pm is not available, i can do 2 pm",
  "my son needs a hair cut. He will be taking the usually cut, a slickback. Same time as well, tuesday at [2 pm] (time). If [2 pm] (time) is not available, i can do [2 pm] (time)",
  "my son needs a hair cut. He will be taking the usually cut, a slickback. Same time as well, tuesday at [2 pm] (time). If [2 pm] (time) is not available, i can do [2 pm] (time)",
  "Hey, I would to [slickback] (haircut_style) the side on tuesday. Can you create an appointment for me please. I am free in the morning so 2 am to 3 am can work for me",
  "Hey, I would to slickback the side on [tuesday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 2 am to 3 am can work for me",
  "Hey, I would to slickback the side on tuesday. Can you create an appointment for me please. I am free in the [morning] (time) so 2 am to 3 am can work for me",
  "Hey, I would to slickback the side on tuesday. Can you create an appointment for me please. I am free in the morning so [2 am] (time) to 3 am can work for me",
  "Hey, I would to slickback the side on tuesday. Can you create an appointment for me please. I am free in the morning so 2 am to [3 am] (time) can work for me",
  "I need a [slickback] (haircut_style) before tuesday. Anytime in the afternoon like 2:30 pm is good",
  "I need a slickback before [tuesday] (dayofweek). Anytime in the afternoon like 2:30 pm is good",
  "I need a slickback before tuesday. Anytime in the [afternoon] (time) like 2:30 pm is good",
  "I need a slickback before tuesday. Anytime in the afternoon like [2:30 pm] (time) is good",
  "Please create an appointment next week [tuesday] (dayofweek) at 2 pm for me. I have to fix my slickback and take a taper.",
  "Please create an appointment next week tuesday at [2 pm] (time) for me. I have to fix my slickback and take a taper.",
  "Please create an appointment next week tuesday at 2 pm for me. I have to fix my [slickback] (haircut_style) and take a taper.",
  "Please create an appointment next week tuesday at 2 pm for me. I have to fix my slickback and take a [taper] (haircut_style).",
  "My son need a haircut at [ 2 pm] (time) tomorrow. He will be taking the usual a slickback",
  "My son need a haircut at  2 pm [tomorrow] (dayofweek). He will be taking the usual a slickback",
  "My son need a haircut at  2 pm tomorrow. He will be taking the usual a [slickback] (haircut_style)",
  "my hair needs to cut. When is the earliest i can have a [slickback] (haircut_style). I am only available in the morning",
  "my hair needs to cut. When is the [earliest] (dayofweek) i can have a slickback. I am only available in the morning",
  "my hair needs to cut. When is the earliest i can have a slickback. I am only available in the [morning] (time)",
  "[Next week] (dayofweek) tuesday the 10 i need slickback. Anytime is good for me, but I prefer the afternoon",
  "Next week [tuesday] (dayofweek) the 10 i need slickback. Anytime is good for me, but I prefer the afternoon",
  "Next week tuesday the 10 i need [slickback] (haircut_style). Anytime is good for me, but I prefer the afternoon",
  "Next week tuesday the 10 i need slickback. Anytime is good for me, but I prefer the [afternoon] (time)",
  "Next week tuesday the 10 i need slickback. [Anytime] (time) is good for me, but I prefer the afternoon",
  "[2 pm] (time) on tuesday is fine",
  "2 pm on [tuesday] (dayofweek) is fine",
  "I would like a [slickback] (haircut_style) at 1:00 pm on tuesday",
  "I would like a slickback at [1:00 pm] (time) on tuesday",
  "I would like a slickback at 1:00 pm on [tuesday] (dayofweek)",
  "Please create an appointment next week [tuesday] (dayofweek) at 2 pm for me. I want to take a taper and a slickback.",
  "Please create an appointment next week tuesday at [2 pm] (time) for me. I want to take a taper and a slickback.",
  "Please create an appointment next week tuesday at 2 pm for me. I want to take a [taper] (haircut_style) and a slickback.",
  "Please create an appointment next week tuesday at 2 pm for me. I want to take a taper and a [slickback] (haircut_style).",
  "my hair needs a trim. When is the earliest i can have a [slickback] (haircut_style). I am only available in the morning on tuesday",
  "my hair needs a trim. When is the earliest i can have a slickback. I am only available in the morning on [tuesday] (dayofweek)",
  "I would like a [slickback] (haircut_style) at 2 pm on tuesday",
  "I would like a slickback at [2 pm] (time) on tuesday",
  "I would like a slickback at 2 pm on [tuesday] (dayofweek)",
  "I just need a [slickback] (haircut_style) on tuesday at 2 pm",
  "I just need a slickback on [tuesday] (dayofweek) at 2 pm",
  "I just need a slickback on tuesday at [2 pm] (time)",
  "My son need a haircut_style at  [2 pm] (time) tomorrow. He will be taking the usual slickback on tuesday",
  "My son need a haircut_style at  2 pm tomorrow. He will be taking the usual [slickback] (haircut_style) on tuesday",
  "My son need a haircut_style at  2 pm tomorrow. He will be taking the usual slickback on [tuesday] (dayofweek)",
  "i want [slickback] (haircut_style). tuesday is a good day to cut my hair at 2 pm",
  "i want slickback. [tuesday] (dayofweek) is a good day to cut my hair at 2 pm",
  "i want slickback. tuesday is a good day to cut my hair at [2 pm] (time)",
  "The day i want to cut my hair is [tuesday] (dayofweek). I need a slickback at 2 pm",
  "The day i want to cut my hair is tuesday. I need a [slickback] (haircut_style) at 2 pm",
  "The day i want to cut my hair is tuesday. I need a slickback at [2 pm] (time)",
  "I am free [tuesday] (dayofweek) and i am looking for a haircut. I am thinking about a slickback. The time i want to cut it is 2 pm",
  "I am free tuesday and i am looking for a haircut. I am thinking about a [slickback] (haircut_style). The time i want to cut it is 2 pm",
  "I am free tuesday and i am looking for a haircut. I am thinking about a slickback. The time i want to cut it is [2 pm] (time)",
  "[tuesday] (dayofweek) is a good day to cut my hair. I want a slickback at 2 pm",
  "tuesday is a good day to cut my hair. I want a [slickback] (haircut_style) at 2 pm",
  "tuesday is a good day to cut my hair. I want a slickback at [2 pm] (time)",
  "Next week [tuesday] (dayofweek) i want to get a slickback at 2 pm",
  "Next week tuesday i want to get a [slickback] (haircut_style) at 2 pm",
  "Next week tuesday i want to get a slickback at [2 pm] (time)",
  "On [tuesday] (dayofweek) 13. I want to get a slickback at 2 pm",
  "On tuesday 13. I want to get a [slickback] (haircut_style) at 2 pm",
  "On tuesday 13. I want to get a slickback at [2 pm] (time)",
  "I will take a [slickback] (haircut_style) tuesday at 2 pm",
  "I will take a slickback [tuesday] (dayofweek) at 2 pm",
  "I will take a slickback tuesday at [2 pm] (time)",
  "I am going to the barber on [tuesday] (dayofweek) at 2 pm for a slickback",
  "I am going to the barber on tuesday at [2 pm] (time) for a slickback",
  "I am going to the barber on tuesday at 2 pm for a [slickback] (haircut_style)",
  "[tuesday] (dayofweek) coming is when i will take a slickback. The time i am free is 2 pm",
  "tuesday coming is when i will take a [slickback] (haircut_style). The time i am free is 2 pm",
  "tuesday coming is when i will take a slickback. The time i am free is [2 pm] (time)",
  "[tuesday] (dayofweek) is a good day",
  "i would like a [slickback] (haircut_style) hairstyle",
  "I am free on [tuesday] (dayofweek)",
  "[tuesday] (dayofweek) can work for me",
  "i need a [slickback] (haircut_style) haircut",
  "I need a trim and a [slickback] (haircut_style) tomorrow at 2 pm. If it's not available next tuesday in the afternoon around 2",
  "I need a trim and a slickback tomorrow at [2 pm] (time). If it's not available next tuesday in the afternoon around 2",
  "I need a trim and a slickback tomorrow at 2 pm. If it's not available next [tuesday] (dayofweek) in the afternoon around 2",
  "I need a trim and a slickback tomorrow at 2 pm. If it's not available next tuesday in the [afternoon] (time) around 2",
  "Can you give me a [slickback] (haircut_style) or [slickback] (haircut_style). I can go for tuesday or wednesday around 2 in the morning",
  "Can you give me a [slickback] (haircut_style) or [slickback] (haircut_style). I can go for tuesday or wednesday around 2 in the morning",
  "Can you give me a slickback or slickback. I can go for [tuesday] (dayofweek) or wednesday around 2 in the morning",
  "Can you give me a slickback or slickback. I can go for tuesday or [wednesday] (dayofweek) around 2 in the morning",
  "Can you give me a slickback or slickback. I can go for tuesday or wednesday around 2 in the [morning] (time)",
  "I just want a [slickback] (haircut_style), nothing too fancy. will tomorrow around 2 in the afternoon work",
  "I just want a slickback, nothing too fancy. will [tomorrow] (dayofweek) around 2 in the afternoon work",
  "I just want a slickback, nothing too fancy. will tomorrow around 2 in the [afternoon] (time) work",
  "i am looking for something different like a [slickback] (haircut_style) or a manbun. Anytime around 2 O'clock is fine on tuesday.",
  "i am looking for something different like a slickback or a [manbun] (haircut_style). Anytime around 2 O'clock is fine on tuesday.",
  "i am looking for something different like a slickback or a manbun. Anytime around [2 O'clock] (time) is fine on tuesday.",
  "i am looking for something different like a slickback or a manbun. Anytime around 2 O'clock is fine on [tuesday] (dayofweek).",
  "can i have a [slickback] (haircut_style) on tuesday in the morning at 2 or 3 am?",
  "can i have a slickback on [tuesday] (dayofweek) in the morning at 2 or 3 am?",
  "can i have a slickback on tuesday in the [morning] (time) at 2 or 3 am?",
  "can i have a slickback on tuesday in the morning at 2 or [3 am] (time)?",
  "Hey, I would a [slickback] (haircut_style) on tuesday. Can you create an appointment for me please. I am free in the morning so 2 am to 3 am can work for me",
  "Hey, I would a slickback on [tuesday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 2 am to 3 am can work for me",
  "Hey, I would a slickback on tuesday. Can you create an appointment for me please. I am free in the morning so [2 am] (time) to 3 am can work for me",
  "Hey, I would a slickback on tuesday. Can you create an appointment for me please. I am free in the morning so 2 am to [3 am] (time) can work for me",
  "I would like a [manbun] (haircut_style) at 3:30 pm",
  "I would like a manbun at [3:30 pm] (time)",
  "I just need a [manbun] (haircut_style) on wednesday at 3 pm",
  "I just need a manbun on [wednesday] (dayofweek) at 3 pm",
  "I just need a manbun on wednesday at [3 pm] (time)",
  "I need a [manbun] (haircut_style) at 3:30 pm on wednesday",
  "I need a manbun at [3:30 pm] (time) on wednesday",
  "I need a manbun at 3:30 pm on [wednesday] (dayofweek)",
  "I am thinking about a [manbun] (haircut_style). I would like to cut on wednesday at 3 O'clock",
  "I am thinking about a manbun. I would like to cut on [wednesday] (dayofweek) at 3 O'clock",
  "I am thinking about a manbun. I would like to cut on wednesday at [3 O'clock] (time)",
  "I am thinking about a [manbun] (haircut_style). I would like to cut on wednesday at 3 O'clock",
  "I am thinking about a manbun. I would like to cut on [wednesday] (dayofweek) at 3 O'clock",
  "I am thinking about a manbun. I would like to cut on wednesday at [3 O'clock] (time)",
  "I am thinking about a [manbun] (haircut_style). I would like to cut on wednesday at 3 O'clock",
  "I am thinking about a manbun. I would like to cut on [wednesday] (dayofweek) at 3 O'clock",
  "I am thinking about a manbun. I would like to cut on wednesday at [3 O'clock] (time)",
  "I will go with a [manbun] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like wednesday at 3:30 pm",
  "I will go with a manbun. My girlfriend really like that. Can we do it as soon as possible like [wednesday] (dayofweek) at 3:30 pm",
  "I will go with a manbun. My girlfriend really like that. Can we do it as soon as possible like wednesday at [3:30 pm] (time)",
  "I will go with a [manbun] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like wednesday at 3:30 pm",
  "I will go with a manbun. My girlfriend really like that. Can we do it as soon as possible like [wednesday] (dayofweek) at 3:30 pm",
  "I will go with a manbun. My girlfriend really like that. Can we do it as soon as possible like wednesday at [3:30 pm] (time)",
  "I will go with a [manbun] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like wednesday at 3:30 pm",
  "I will go with a manbun. My girlfriend really like that. Can we do it as soon as possible like [wednesday] (dayofweek) at 3:30 pm",
  "I will go with a manbun. My girlfriend really like that. Can we do it as soon as possible like wednesday at [3:30 pm] (time)",
  "i am looking for something funny like a [manbun] (haircut_style). Can we do it at 3 O'clock on wednesday.",
  "i am looking for something funny like a manbun. Can we do it at [3 O'clock] (time) on wednesday.",
  "i am looking for something funny like a manbun. Can we do it at 3 O'clock on [wednesday] (dayofweek).",
  "Hey, please create an appointment to cut my hair on [wednesday] (dayofweek) around 3 O'clock in the morning. I just need a manbun",
  "Hey, please create an appointment to cut my hair on wednesday around [3 O'clock in the morning] (time). I just need a manbun",
  "Hey, please create an appointment to cut my hair on wednesday around 3 O'clock in the morning. I just need a [manbun] (haircut_style)",
  "my son needs a hair cut. He will be taking the usually cut, a [manbun] (haircut_style). Same time as well, wednesday at 3 pm. If 3 pm is not available, i can do 3 pm",
  "my son needs a hair cut. He will be taking the usually cut, a manbun. Same time as well, [wednesday] (dayofweek) at 3 pm. If 3 pm is not available, i can do 3 pm",
  "my son needs a hair cut. He will be taking the usually cut, a manbun. Same time as well, wednesday at [3 pm] (time). If [3 pm] (time) is not available, i can do [3 pm] (time)",
  "my son needs a hair cut. He will be taking the usually cut, a manbun. Same time as well, wednesday at [3 pm] (time). If [3 pm] (time) is not available, i can do [3 pm] (time)",
  "I need a [manbun] (haircut_style) before wednesday. Anytime in the afternoon like 3:30 pm is good",
  "I need a manbun before [wednesday] (dayofweek). Anytime in the afternoon like 3:30 pm is good",
  "I need a manbun before wednesday. Anytime in the [afternoon] (time) like 3:30 pm is good",
  "I need a manbun before wednesday. Anytime in the afternoon like [3:30 pm] (time) is good",
  "My son need a haircut at [ 3 pm] (time) tomorrow. He will be taking the usual a manbun",
  "My son need a haircut at  3 pm [tomorrow] (dayofweek). He will be taking the usual a manbun",
  "My son need a haircut at  3 pm tomorrow. He will be taking the usual a [manbun] (haircut_style)",
  "my hair needs to cut. When is the earliest i can have a [manbun] (haircut_style). I am only available in the morning",
  "my hair needs to cut. When is the [earliest] (dayofweek) i can have a manbun. I am only available in the morning",
  "my hair needs to cut. When is the earliest i can have a manbun. I am only available in the [morning] (time)",
  "[Next week] (dayofweek) wednesday the 10 i need manbun. Anytime is good for me, but I prefer the afternoon",
  "Next week [wednesday] (dayofweek) the 10 i need manbun. Anytime is good for me, but I prefer the afternoon",
  "Next week wednesday the 10 i need [manbun] (haircut_style). Anytime is good for me, but I prefer the afternoon",
  "Next week wednesday the 10 i need manbun. Anytime is good for me, but I prefer the [afternoon] (time)",
  "Next week wednesday the 10 i need manbun. [Anytime] (time) is good for me, but I prefer the afternoon",
  "[3 pm] (time) on wednesday is fine",
  "3 pm on [wednesday] (dayofweek) is fine",
  "I would like a [manbun] (haircut_style) at 3:00 pm on wednesday",
  "I would like a manbun at [3:00 pm] (time) on wednesday",
  "I would like a manbun at 3:00 pm on [wednesday] (dayofweek)",
  "Please create an appointment next week [wednesday] (dayofweek) at 3 pm for me. I want to take a taper and a manbun.",
  "Please create an appointment next week wednesday at [3 pm] (time) for me. I want to take a taper and a manbun.",
  "Please create an appointment next week wednesday at 3 pm for me. I want to take a [taper] (haircut_style) and a manbun.",
  "Please create an appointment next week wednesday at 3 pm for me. I want to take a taper and a [manbun] (haircut_style).",
  "my hair needs a trim. When is the earliest i can have a [manbun] (haircut_style). I am only available in the morning on wednesday",
  "my hair needs a trim. When is the earliest i can have a manbun. I am only available in the morning on [wednesday] (dayofweek)",
  "I would like a [manbun] (haircut_style) at 3 pm on wednesday",
  "I would like a manbun at [3 pm] (time) on wednesday",
  "I would like a manbun at 3 pm on [wednesday] (dayofweek)",
  "I just need a [manbun] (haircut_style) on wednesday at 3 pm",
  "I just need a manbun on [wednesday] (dayofweek) at 3 pm",
  "I just need a manbun on wednesday at [3 pm] (time)",
  "My son need a haircut_style at  [3 pm] (time) tomorrow. He will be taking the usual manbun on wednesday",
  "My son need a haircut_style at  3 pm tomorrow. He will be taking the usual [manbun] (haircut_style) on wednesday",
  "My son need a haircut_style at  3 pm tomorrow. He will be taking the usual manbun on [wednesday] (dayofweek)",
  "i want [manbun] (haircut_style). wednesday is a good day to cut my hair at 3 pm",
  "i want manbun. [wednesday] (dayofweek) is a good day to cut my hair at 3 pm",
  "i want manbun. wednesday is a good day to cut my hair at [3 pm] (time)",
  "The day i want to cut my hair is [wednesday] (dayofweek). I need a manbun at 3 pm",
  "The day i want to cut my hair is wednesday. I need a [manbun] (haircut_style) at 3 pm",
  "The day i want to cut my hair is wednesday. I need a manbun at [3 pm] (time)",
  "I am free [wednesday] (dayofweek) and i am looking for a haircut. I am thinking about a manbun. The time i want to cut it is 3 pm",
  "I am free wednesday and i am looking for a haircut. I am thinking about a [manbun] (haircut_style). The time i want to cut it is 3 pm",
  "I am free wednesday and i am looking for a haircut. I am thinking about a manbun. The time i want to cut it is [3 pm] (time)",
  "[wednesday] (dayofweek) is a good day to cut my hair. I want a manbun at 3 pm",
  "wednesday is a good day to cut my hair. I want a [manbun] (haircut_style) at 3 pm",
  "wednesday is a good day to cut my hair. I want a manbun at [3 pm] (time)",
  "Next week [wednesday] (dayofweek) i want to get a manbun at 3 pm",
  "Next week wednesday i want to get a [manbun] (haircut_style) at 3 pm",
  "Next week wednesday i want to get a manbun at [3 pm] (time)",
  "On [wednesday] (dayofweek) 13. I want to get a manbun at 3 pm",
  "On wednesday 13. I want to get a [manbun] (haircut_style) at 3 pm",
  "On wednesday 13. I want to get a manbun at [3 pm] (time)",
  "I will take a [manbun] (haircut_style) wednesday at 3 pm",
  "I will take a manbun [wednesday] (dayofweek) at 3 pm",
  "I will take a manbun wednesday at [3 pm] (time)",
  "I am going to the barber on [wednesday] (dayofweek) at 3 pm for a manbun",
  "I am going to the barber on wednesday at [3 pm] (time) for a manbun",
  "I am going to the barber on wednesday at 3 pm for a [manbun] (haircut_style)",
  "[wednesday] (dayofweek) coming is when i will take a manbun. The time i am free is 3 pm",
  "wednesday coming is when i will take a [manbun] (haircut_style). The time i am free is 3 pm",
  "wednesday coming is when i will take a manbun. The time i am free is [3 pm] (time)",
  "[wednesday] (dayofweek) is a good day",
  "i would like a [manbun] (haircut_style) hairstyle",
  "I am free on [wednesday] (dayofweek)",
  "[wednesday] (dayofweek) can work for me",
  "i need a [manbun] (haircut_style) haircut",
  "I need a trim and a [manbun] (haircut_style) tomorrow at 3 pm. If it's not available next wednesday in the afternoon around 3",
  "I need a trim and a manbun tomorrow at [3 pm] (time). If it's not available next wednesday in the afternoon around 3",
  "I need a trim and a manbun tomorrow at 3 pm. If it's not available next [wednesday] (dayofweek) in the afternoon around 3",
  "I need a trim and a manbun tomorrow at 3 pm. If it's not available next wednesday in the [afternoon] (time) around 3",
  "Can you give me a [manbun] (haircut_style) or buzzcut. I can go for wednesday or thursday around 3 in the morning",
  "Can you give me a manbun or [buzzcut] (haircut_style). I can go for wednesday or thursday around 3 in the morning",
  "Can you give me a manbun or buzzcut. I can go for [wednesday] (dayofweek) or thursday around 3 in the morning",
  "Can you give me a manbun or buzzcut. I can go for wednesday or [thursday] (dayofweek) around 3 in the morning",
  "Can you give me a manbun or buzzcut. I can go for wednesday or thursday around 3 in the [morning] (time)",
  "I just want a [manbun] (haircut_style), nothing too fancy. will tomorrow around 3 in the afternoon work",
  "I just want a manbun, nothing too fancy. will [tomorrow] (dayofweek) around 3 in the afternoon work",
  "I just want a manbun, nothing too fancy. will tomorrow around 3 in the [afternoon] (time) work",
  "i am looking for something different like a [manbun] (haircut_style) or a buzzcut. Anytime around 3 O'clock is fine on wednesday.",
  "i am looking for something different like a manbun or a [buzzcut] (haircut_style). Anytime around 3 O'clock is fine on wednesday.",
  "i am looking for something different like a manbun or a buzzcut. Anytime around [3 O'clock] (time) is fine on wednesday.",
  "i am looking for something different like a manbun or a buzzcut. Anytime around 3 O'clock is fine on [wednesday] (dayofweek).",
  "can i have a [manbun] (haircut_style) on wednesday in the morning at 3 or 3 am?",
  "can i have a manbun on [wednesday] (dayofweek) in the morning at 3 or 3 am?",
  "can i have a manbun on wednesday in the [morning] (time) at 3 or 3 am?",
  "can i have a manbun on wednesday in the morning at 3 or [3 am] (time)?",
  "Hey, I would a [manbun] (haircut_style) on wednesday. Can you create an appointment for me please. I am free in the morning so 3 am to 3 am can work for me",
  "Hey, I would a manbun on [wednesday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 3 am to 3 am can work for me",
  "Hey, I would a manbun on wednesday. Can you create an appointment for me please. I am free in the morning so [3 am to 3 am] (time) can work for me",
  "Hey, I would to [manbun] (haircut_style) the side on wednesday. Can you create an appointment for me please. I am free in the morning so 3 am to 4 am can work for me",
  "Hey, I would to manbun the side on [wednesday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 3 am to 4 am can work for me",
  "Hey, I would to manbun the side on wednesday. Can you create an appointment for me please. I am free in the [morning] (time) so 3 am to 4 am can work for me",
  "Hey, I would to manbun the side on wednesday. Can you create an appointment for me please. I am free in the morning so 3 am to [4 am] (time) can work for me",
  "Hey, I would to manbun the side on wednesday. Can you create an appointment for me please. I am free in the morning so [3 am] (time) to 4 am can work for me",
  "Please create an appointment next week [wednesday] (dayofweek) at 3 pm for me. I have to fix my manbun and take a taper.",
  "Please create an appointment next week wednesday at [3 pm] (time) for me. I have to fix my manbun and take a taper.",
  "Please create an appointment next week wednesday at 3 pm for me. I have to fix my [manbun] (haircut_style) and take a taper.",
  "Please create an appointment next week wednesday at 3 pm for me. I have to fix my manbun and take a [taper] (haircut_style).",
  "I would like a [manbun] (haircut_style) at 3:00 pm on wednesday",
  "I would like a manbun at [3:00 pm] (time) on wednesday",
  "I would like a manbun at 3:00 pm on [wednesday] (dayofweek)",
  "I would like a [buzzcut] (haircut_style) at 4:30 pm",
  "I would like a buzzcut at [4:30 pm] (time)",
  "I just need a [buzzcut] (haircut_style) on thursday at 4 pm",
  "I just need a buzzcut on [thursday] (dayofweek) at 4 pm",
  "I just need a buzzcut on thursday at [4 pm] (time)",
  "I need a [buzzcut] (haircut_style) at 4:30 pm on thursday",
  "I need a buzzcut at [4:30 pm] (time) on thursday",
  "I need a buzzcut at 4:30 pm on [thursday] (dayofweek)",
  "I am thinking about a [buzzcut] (haircut_style). I would like to cut on thursday at 4 O'clock",
  "I am thinking about a buzzcut. I would like to cut on [thursday] (dayofweek) at 4 O'clock",
  "I am thinking about a buzzcut. I would like to cut on thursday at [4 O'clock] (time)",
  "I am thinking about a [buzzcut] (haircut_style). I would like to cut on thursday at 4 O'clock",
  "I am thinking about a buzzcut. I would like to cut on [thursday] (dayofweek) at 4 O'clock",
  "I am thinking about a buzzcut. I would like to cut on thursday at [4 O'clock] (time)",
  "I am thinking about a [buzzcut] (haircut_style). I would like to cut on thursday at 4 O'clock",
  "I am thinking about a buzzcut. I would like to cut on [thursday] (dayofweek) at 4 O'clock",
  "I am thinking about a buzzcut. I would like to cut on thursday at [4 O'clock] (time)",
  "I will go with a [buzzcut] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like thursday at 4:30 pm",
  "I will go with a buzzcut. My girlfriend really like that. Can we do it as soon as possible like [thursday] (dayofweek) at 4:30 pm",
  "I will go with a buzzcut. My girlfriend really like that. Can we do it as soon as possible like thursday at [4:30 pm] (time)",
  "I will go with a [buzzcut] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like thursday at 4:30 pm",
  "I will go with a buzzcut. My girlfriend really like that. Can we do it as soon as possible like [thursday] (dayofweek) at 4:30 pm",
  "I will go with a buzzcut. My girlfriend really like that. Can we do it as soon as possible like thursday at [4:30 pm] (time)",
  "I will go with a [buzzcut] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like thursday at 4:30 pm",
  "I will go with a buzzcut. My girlfriend really like that. Can we do it as soon as possible like [thursday] (dayofweek) at 4:30 pm",
  "I will go with a buzzcut. My girlfriend really like that. Can we do it as soon as possible like thursday at [4:30 pm] (time)",
  "i am looking for something funny like a [buzzcut] (haircut_style). Can we do it at 4 O'clock on thursday.",
  "i am looking for something funny like a buzzcut. Can we do it at [4 O'clock] (time) on thursday.",
  "i am looking for something funny like a buzzcut. Can we do it at 4 O'clock on [thursday] (dayofweek).",
  "Hey, please create an appointment to cut my hair on [thursday] (dayofweek) around 4 O'clock in the morning. I just need a buzzcut",
  "Hey, please create an appointment to cut my hair on thursday around [4 O'clock in the morning] (time). I just need a buzzcut",
  "Hey, please create an appointment to cut my hair on thursday around 4 O'clock in the morning. I just need a [buzzcut] (haircut_style)",
  "my son needs a hair cut. He will be taking the usually cut, a [buzzcut] (haircut_style). Same time as well, thursday at 4 pm. If 4 pm is not available, i can do 4 pm",
  "my son needs a hair cut. He will be taking the usually cut, a buzzcut. Same time as well, [thursday] (dayofweek) at 4 pm. If 4 pm is not available, i can do 4 pm",
  "my son needs a hair cut. He will be taking the usually cut, a buzzcut. Same time as well, thursday at [4 pm] (time). If [4 pm] (time) is not available, i can do [4 pm] (time)",
  "my son needs a hair cut. He will be taking the usually cut, a buzzcut. Same time as well, thursday at [4 pm] (time). If [4 pm] (time) is not available, i can do [4 pm] (time)",
  "I need a [buzzcut] (haircut_style) before thursday. Anytime in the afternoon like 4:30 pm is good",
  "I need a buzzcut before [thursday] (dayofweek). Anytime in the afternoon like 4:30 pm is good",
  "I need a buzzcut before thursday. Anytime in the [afternoon] (time) like 4:30 pm is good",
  "I need a buzzcut before thursday. Anytime in the afternoon like [4:30 pm] (time) is good",
  "My son need a haircut at [ 4 pm] (time) tomorrow. He will be taking the usual a buzzcut",
  "My son need a haircut at  4 pm [tomorrow] (dayofweek). He will be taking the usual a buzzcut",
  "My son need a haircut at  4 pm tomorrow. He will be taking the usual a [buzzcut] (haircut_style)",
  "my hair needs to cut. When is the earliest i can have a [buzzcut] (haircut_style). I am only available in the morning",
  "my hair needs to cut. When is the [earliest] (dayofweek) i can have a buzzcut. I am only available in the morning",
  "my hair needs to cut. When is the earliest i can have a buzzcut. I am only available in the [morning] (time)",
  "[Next week] (dayofweek) thursday the 4 i need buzzcut. Anytime is good for me, but I prefer the afternoon",
  "Next week [thursday] (dayofweek) the 4 i need buzzcut. Anytime is good for me, but I prefer the afternoon",
  "Next week thursday the 4 i need [buzzcut] (haircut_style). Anytime is good for me, but I prefer the afternoon",
  "Next week thursday the 4 i need buzzcut. Anytime is good for me, but I prefer the [afternoon] (time)",
  "Next week thursday the 4 i need buzzcut. [Anytime] (time) is good for me, but I prefer the afternoon",
  "[4 pm] (time) on thursday is fine",
  "4 pm on [thursday] (dayofweek) is fine",
  "I would like a [buzzcut] (haircut_style) at 4:00 pm on thursday",
  "I would like a buzzcut at [4:00 pm] (time) on thursday",
  "I would like a buzzcut at 4:00 pm on [thursday] (dayofweek)",
  "Please create an appointment next week [thursday] (dayofweek) at 4 pm for me. I want to take a fade and a buzzcut.",
  "Please create an appointment next week thursday at [4 pm] (time) for me. I want to take a fade and a buzzcut.",
  "Please create an appointment next week thursday at 4 pm for me. I want to take a [fade] (haircut_style) and a buzzcut.",
  "Please create an appointment next week thursday at 4 pm for me. I want to take a fade and a [buzzcut] (haircut_style).",
  "my hair needs a trim. When is the earliest i can have a [buzzcut] (haircut_style). I am only available in the morning on thursday",
  "my hair needs a trim. When is the earliest i can have a buzzcut. I am only available in the morning on [thursday] (dayofweek)",
  "I would like a [buzzcut] (haircut_style) at 4 pm on thursday",
  "I would like a buzzcut at [4 pm] (time) on thursday",
  "I would like a buzzcut at 4 pm on [thursday] (dayofweek)",
  "I just need a [buzzcut] (haircut_style) on thursday at 4 pm",
  "I just need a buzzcut on [thursday] (dayofweek) at 4 pm",
  "I just need a buzzcut on thursday at [4 pm] (time)",
  "My son need a haircut_style at  [4 pm] (time) tomorrow. He will be taking the usual buzzcut on thursday",
  "My son need a haircut_style at  4 pm tomorrow. He will be taking the usual [buzzcut] (haircut_style) on thursday",
  "My son need a haircut_style at  4 pm tomorrow. He will be taking the usual buzzcut on [thursday] (dayofweek)",
  "i want [buzzcut] (haircut_style). thursday is a good day to cut my hair at 4 pm",
  "i want buzzcut. [thursday] (dayofweek) is a good day to cut my hair at 4 pm",
  "i want buzzcut. thursday is a good day to cut my hair at [4 pm] (time)",
  "The day i want to cut my hair is [thursday] (dayofweek). I need a buzzcut at 4 pm",
  "The day i want to cut my hair is thursday. I need a [buzzcut] (haircut_style) at 4 pm",
  "The day i want to cut my hair is thursday. I need a buzzcut at [4 pm] (time)",
  "I am free [thursday] (dayofweek) and i am looking for a haircut. I am thinking about a buzzcut. The time i want to cut it is 4 pm",
  "I am free thursday and i am looking for a haircut. I am thinking about a [buzzcut] (haircut_style). The time i want to cut it is 4 pm",
  "I am free thursday and i am looking for a haircut. I am thinking about a buzzcut. The time i want to cut it is [4 pm] (time)",
  "[thursday] (dayofweek) is a good day to cut my hair. I want a buzzcut at 4 pm",
  "thursday is a good day to cut my hair. I want a [buzzcut] (haircut_style) at 4 pm",
  "thursday is a good day to cut my hair. I want a buzzcut at [4 pm] (time)",
  "Next week [thursday] (dayofweek) i want to get a buzzcut at 4 pm",
  "Next week thursday i want to get a [buzzcut] (haircut_style) at 4 pm",
  "Next week thursday i want to get a buzzcut at [4 pm] (time)",
  "On [thursday] (dayofweek) 13. I want to get a buzzcut at 4 pm",
  "On thursday 13. I want to get a [buzzcut] (haircut_style) at 4 pm",
  "On thursday 13. I want to get a buzzcut at [4 pm] (time)",
  "I will take a [buzzcut] (haircut_style) thursday at 4 pm",
  "I will take a buzzcut [thursday] (dayofweek) at 4 pm",
  "I will take a buzzcut thursday at [4 pm] (time)",
  "I am going to the barber on [thursday] (dayofweek) at 4 pm for a buzzcut",
  "I am going to the barber on thursday at [4 pm] (time) for a buzzcut",
  "I am going to the barber on thursday at 4 pm for a [buzzcut] (haircut_style)",
  "[thursday] (dayofweek) coming is when i will take a buzzcut. The time i am free is 4 pm",
  "thursday coming is when i will take a [buzzcut] (haircut_style). The time i am free is 4 pm",
  "thursday coming is when i will take a buzzcut. The time i am free is [4 pm] (time)",
  "[thursday] (dayofweek) is a good day",
  "i would like a [buzzcut] (haircut_style) hairstyle",
  "I am free on [thursday] (dayofweek)",
  "[thursday] (dayofweek) can work for me",
  "i need a [buzzcut] (haircut_style) haircut",
  "I need a trim and a [buzzcut] (haircut_style) tomorrow at 4 pm. If it's not available next thursday in the afternoon around 4",
  "I need a trim and a buzzcut tomorrow at [4 pm] (time). If it's not available next thursday in the afternoon around 4",
  "I need a trim and a buzzcut tomorrow at 4 pm. If it's not available next [thursday] (dayofweek) in the afternoon around 4",
  "I need a trim and a buzzcut tomorrow at 4 pm. If it's not available next thursday in the [afternoon] (time) around 4",
  "Can you give me a [buzzcut] (haircut_style) or ponytail. I can go for thursday or friday around 4 in the morning",
  "Can you give me a buzzcut or [ponytail] (haircut_style). I can go for thursday or friday around 4 in the morning",
  "Can you give me a buzzcut or ponytail. I can go for [thursday] (dayofweek) or friday around 4 in the morning",
  "Can you give me a buzzcut or ponytail. I can go for thursday or [friday] (dayofweek) around 4 in the morning",
  "Can you give me a buzzcut or ponytail. I can go for thursday or friday around 4 in the [morning] (time)",
  "I just want a [buzzcut] (haircut_style), nothing too fancy. will tomorrow around 4 in the afternoon work",
  "I just want a buzzcut, nothing too fancy. will [tomorrow] (dayofweek) around 4 in the afternoon work",
  "I just want a buzzcut, nothing too fancy. will tomorrow around 4 in the [afternoon] (time) work",
  "i am looking for something different like a [buzzcut] (haircut_style) or a ponytail. Anytime around 4 O'clock is fine on thursday.",
  "i am looking for something different like a buzzcut or a [ponytail] (haircut_style). Anytime around 4 O'clock is fine on thursday.",
  "i am looking for something different like a buzzcut or a ponytail. Anytime around [4 O'clock] (time) is fine on thursday.",
  "i am looking for something different like a buzzcut or a ponytail. Anytime around 4 O'clock is fine on [thursday] (dayofweek).",
  "can i have a [buzzcut] (haircut_style) on thursday in the morning at 4 or 4 am?",
  "can i have a buzzcut on [thursday] (dayofweek) in the morning at 4 or 4 am?",
  "can i have a buzzcut on thursday in the [morning] (time) at 4 or 4 am?",
  "can i have a buzzcut on thursday in the morning at 4 or [4 am] (time)?",
  "Hey, I would a [buzzcut] (haircut_style) on thursday. Can you create an appointment for me please. I am free in the morning so 4 am to 5 am can work for me",
  "Hey, I would a buzzcut on [thursday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 4 am to 5 am can work for me",
  "Hey, I would a buzzcut on thursday. Can you create an appointment for me please. I am free in the morning so [4 am] (time) to 5 am can work for me",
  "Hey, I would a buzzcut on thursday. Can you create an appointment for me please. I am free in the morning so 4 am to [5 am] (time) can work for me",
  "Hey, I would to [buzzcut] (haircut_style) the side on thursday. Can you create an appointment for me please. I am free in the morning so 4 am to 5 am can work for me",
  "Hey, I would to buzzcut the side on [thursday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 4 am to 5 am can work for me",
  "Hey, I would to buzzcut the side on thursday. Can you create an appointment for me please. I am free in the [morning] (time) so 4 am to 5 am can work for me",
  "Hey, I would to buzzcut the side on thursday. Can you create an appointment for me please. I am free in the morning so 4 am to [5 am] (time) can work for me",
  "Hey, I would to buzzcut the side on thursday. Can you create an appointment for me please. I am free in the morning so [4 am] (time) to 5 am can work for me",
  "Please create an appointment next week [thursday] (dayofweek) at 4 pm for me. I have to fix my buzzcut and take a fade.",
  "Please create an appointment next week thursday at [4 pm] (time) for me. I have to fix my buzzcut and take a fade.",
  "Please create an appointment next week thursday at 4 pm for me. I have to fix my [buzzcut] (haircut_style) and take a fade.",
  "Please create an appointment next week thursday at 4 pm for me. I have to fix my buzzcut and take a [fade] (haircut_style).",
  "I would like a [buzzcut] (haircut_style) at 4:00 pm on thursday",
  "I would like a buzzcut at [4:00 pm] (time) on thursday",
  "I would like a buzzcut at 4:00 pm on [thursday] (dayofweek)",
  "I would like a [ponytail] (haircut_style) at 5:30 pm",
  "I would like a ponytail at [5:30 pm] (time)",
  "I just need a [ponytail] (haircut_style) on friday at 5 pm",
  "I just need a ponytail on [friday] (dayofweek) at 5 pm",
  "I just need a ponytail on friday at [5 pm] (time)",
  "I need a [ponytail] (haircut_style) at 5:30 pm on friday",
  "I need a ponytail at [5:30 pm] (time) on friday",
  "I need a ponytail at 5:30 pm on [friday] (dayofweek)",
  "I am thinking about a [ponytail] (haircut_style). I would like to cut on friday at 5 O'clock",
  "I am thinking about a ponytail. I would like to cut on [friday] (dayofweek) at 5 O'clock",
  "I am thinking about a ponytail. I would like to cut on friday at [5 O'clock] (time)",
  "I am thinking about a [ponytail] (haircut_style). I would like to cut on friday at 5 O'clock",
  "I am thinking about a ponytail. I would like to cut on [friday] (dayofweek) at 5 O'clock",
  "I am thinking about a ponytail. I would like to cut on friday at [5 O'clock] (time)",
  "I am thinking about a [ponytail] (haircut_style). I would like to cut on friday at 5 O'clock",
  "I am thinking about a ponytail. I would like to cut on [friday] (dayofweek) at 5 O'clock",
  "I am thinking about a ponytail. I would like to cut on friday at [5 O'clock] (time)",
  "I will go with a [ponytail] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like friday at 5:30 pm",
  "I will go with a ponytail. My girlfriend really like that. Can we do it as soon as possible like [friday] (dayofweek) at 5:30 pm",
  "I will go with a ponytail. My girlfriend really like that. Can we do it as soon as possible like friday at [5:30 pm] (time)",
  "I will go with a [ponytail] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like friday at 5:30 pm",
  "I will go with a ponytail. My girlfriend really like that. Can we do it as soon as possible like [friday] (dayofweek) at 5:30 pm",
  "I will go with a ponytail. My girlfriend really like that. Can we do it as soon as possible like friday at [5:30 pm] (time)",
  "I will go with a [ponytail] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like friday at 5:30 pm",
  "I will go with a ponytail. My girlfriend really like that. Can we do it as soon as possible like [friday] (dayofweek) at 5:30 pm",
  "I will go with a ponytail. My girlfriend really like that. Can we do it as soon as possible like friday at [5:30 pm] (time)",
  "i am looking for something funny like a [ponytail] (haircut_style). Can we do it at 5 O'clock on friday.",
  "i am looking for something funny like a ponytail. Can we do it at [5 O'clock] (time) on friday.",
  "i am looking for something funny like a ponytail. Can we do it at 5 O'clock on [friday] (dayofweek).",
  "Hey, please create an appointment to cut my hair on [friday] (dayofweek) around 5 O'clock in the morning. I just need a ponytail",
  "Hey, please create an appointment to cut my hair on friday around [5 O'clock in the morning] (time). I just need a ponytail",
  "Hey, please create an appointment to cut my hair on friday around 5 O'clock in the morning. I just need a [ponytail] (haircut_style)",
  "my son needs a hair cut. He will be taking the usually cut, a [ponytail] (haircut_style). Same time as well, friday at 5 pm. If 5 pm is not available, i can do 5 pm",
  "my son needs a hair cut. He will be taking the usually cut, a ponytail. Same time as well, [friday] (dayofweek) at 5 pm. If 5 pm is not available, i can do 5 pm",
  "my son needs a hair cut. He will be taking the usually cut, a ponytail. Same time as well, friday at [5 pm] (time). If [5 pm] (time) is not available, i can do [5 pm] (time)",
  "my son needs a hair cut. He will be taking the usually cut, a ponytail. Same time as well, friday at [5 pm] (time). If [5 pm] (time) is not available, i can do [5 pm] (time)",
  "I need a [ponytail] (haircut_style) before friday. Anytime in the afternoon like 5:30 pm is good",
  "I need a ponytail before [friday] (dayofweek). Anytime in the afternoon like 5:30 pm is good",
  "I need a ponytail before friday. Anytime in the [afternoon] (time) like 5:30 pm is good",
  "I need a ponytail before friday. Anytime in the afternoon like [5:30 pm] (time) is good",
  "My son need a haircut at [ 5 pm] (time) tomorrow. He will be taking the usual a ponytail",
  "My son need a haircut at  5 pm [tomorrow] (dayofweek). He will be taking the usual a ponytail",
  "My son need a haircut at  5 pm tomorrow. He will be taking the usual a [ponytail] (haircut_style)",
  "my hair needs to cut. When is the earliest i can have a [ponytail] (haircut_style). I am only available in the morning",
  "my hair needs to cut. When is the [earliest] (dayofweek) i can have a ponytail. I am only available in the morning",
  "my hair needs to cut. When is the earliest i can have a ponytail. I am only available in the [morning] (time)",
  "[Next week] (dayofweek) friday the 5 i need ponytail. Anytime is good for me, but I prefer the afternoon",
  "Next week [friday] (dayofweek) the 5 i need ponytail. Anytime is good for me, but I prefer the afternoon",
  "Next week friday the 5 i need [ponytail] (haircut_style). Anytime is good for me, but I prefer the afternoon",
  "Next week friday the 5 i need ponytail. Anytime is good for me, but I prefer the [afternoon] (time)",
  "Next week friday the 5 i need ponytail. [Anytime] (time) is good for me, but I prefer the afternoon",
  "[5 pm] (time) on friday is fine",
  "5 pm on [friday] (dayofweek) is fine",
  "I would like a [ponytail] (haircut_style) at 5:00 pm on friday",
  "I would like a ponytail at [5:00 pm] (time) on friday",
  "I would like a ponytail at 5:00 pm on [friday] (dayofweek)",
  "Please create an appointment next week [friday] (dayofweek) at 5 pm for me. I want to take a fade and a ponytail.",
  "Please create an appointment next week friday at [5 pm] (time) for me. I want to take a fade and a ponytail.",
  "Please create an appointment next week friday at 5 pm for me. I want to take a [fade] (haircut_style) and a ponytail.",
  "Please create an appointment next week friday at 5 pm for me. I want to take a fade and a [ponytail] (haircut_style).",
  "my hair needs a trim. When is the earliest i can have a [ponytail] (haircut_style). I am only available in the morning on friday",
  "my hair needs a trim. When is the earliest i can have a ponytail. I am only available in the morning on [friday] (dayofweek)",
  "I would like a [ponytail] (haircut_style) at 5 pm on friday",
  "I would like a ponytail at [5 pm] (time) on friday",
  "I would like a ponytail at 5 pm on [friday] (dayofweek)",
  "I just need a [ponytail] (haircut_style) on friday at 5 pm",
  "I just need a ponytail on [friday] (dayofweek) at 5 pm",
  "I just need a ponytail on friday at [5 pm] (time)",
  "My son need a haircut_style at  [5 pm] (time) tomorrow. He will be taking the usual ponytail on friday",
  "My son need a haircut_style at  5 pm tomorrow. He will be taking the usual [ponytail] (haircut_style) on friday",
  "My son need a haircut_style at  5 pm tomorrow. He will be taking the usual ponytail on [friday] (dayofweek)",
  "i want [ponytail] (haircut_style). friday is a good day to cut my hair at 5 pm",
  "i want ponytail. [friday] (dayofweek) is a good day to cut my hair at 5 pm",
  "i want ponytail. friday is a good day to cut my hair at [5 pm] (time)",
  "The day i want to cut my hair is [friday] (dayofweek). I need a ponytail at 5 pm",
  "The day i want to cut my hair is friday. I need a [ponytail] (haircut_style) at 5 pm",
  "The day i want to cut my hair is friday. I need a ponytail at [5 pm] (time)",
  "I am free [friday] (dayofweek) and i am looking for a haircut. I am thinking about a ponytail. The time i want to cut it is 5 pm",
  "I am free friday and i am looking for a haircut. I am thinking about a [ponytail] (haircut_style). The time i want to cut it is 5 pm",
  "I am free friday and i am looking for a haircut. I am thinking about a ponytail. The time i want to cut it is [5 pm] (time)",
  "[friday] (dayofweek) is a good day to cut my hair. I want a ponytail at 5 pm",
  "friday is a good day to cut my hair. I want a [ponytail] (haircut_style) at 5 pm",
  "friday is a good day to cut my hair. I want a ponytail at [5 pm] (time)",
  "Next week [friday] (dayofweek) i want to get a ponytail at 5 pm",
  "Next week friday i want to get a [ponytail] (haircut_style) at 5 pm",
  "Next week friday i want to get a ponytail at [5 pm] (time)",
  "On [friday] (dayofweek) 13. I want to get a ponytail at 5 pm",
  "On friday 13. I want to get a [ponytail] (haircut_style) at 5 pm",
  "On friday 13. I want to get a ponytail at [5 pm] (time)",
  "I will take a [ponytail] (haircut_style) friday at 5 pm",
  "I will take a ponytail [friday] (dayofweek) at 5 pm",
  "I will take a ponytail friday at [5 pm] (time)",
  "I am going to the barber on [friday] (dayofweek) at 5 pm for a ponytail",
  "I am going to the barber on friday at [5 pm] (time) for a ponytail",
  "I am going to the barber on friday at 5 pm for a [ponytail] (haircut_style)",
  "[friday] (dayofweek) coming is when i will take a ponytail. The time i am free is 5 pm",
  "friday coming is when i will take a [ponytail] (haircut_style). The time i am free is 5 pm",
  "friday coming is when i will take a ponytail. The time i am free is [5 pm] (time)",
  "[friday] (dayofweek) is a good day",
  "i would like a [ponytail] (haircut_style) hairstyle",
  "I am free on [friday] (dayofweek)",
  "[friday] (dayofweek) can work for me",
  "i need a [ponytail] (haircut_style) haircut",
  "I need a trim and a [ponytail] (haircut_style) tomorrow at 5 pm. If it's not available next friday in the afternoon around 5",
  "I need a trim and a ponytail tomorrow at [5 pm] (time). If it's not available next friday in the afternoon around 5",
  "I need a trim and a ponytail tomorrow at 5 pm. If it's not available next [friday] (dayofweek) in the afternoon around 5",
  "I need a trim and a ponytail tomorrow at 5 pm. If it's not available next friday in the [afternoon] (time) around 5",
  "Can you give me a [ponytail] (haircut_style) or sidepart. I can go for friday or saturday around 5 in the morning",
  "Can you give me a ponytail or [sidepart] (haircut_style). I can go for friday or saturday around 5 in the morning",
  "Can you give me a ponytail or sidepart. I can go for [friday] (dayofweek) or saturday around 5 in the morning",
  "Can you give me a ponytail or sidepart. I can go for friday or [saturday] (dayofweek) around 5 in the morning",
  "Can you give me a ponytail or sidepart. I can go for friday or saturday around 5 in the [morning] (time)",
  "I just want a [ponytail] (haircut_style), nothing too fancy. will tomorrow around 5 in the afternoon work",
  "I just want a ponytail, nothing too fancy. will [tomorrow] (dayofweek) around 5 in the afternoon work",
  "I just want a ponytail, nothing too fancy. will tomorrow around 5 in the [afternoon] (time) work",
  "i am looking for something different like a [ponytail] (haircut_style) or a sidepart. Anytime around 5 O'clock is fine on friday.",
  "i am looking for something different like a ponytail or a [sidepart] (haircut_style). Anytime around 5 O'clock is fine on friday.",
  "i am looking for something different like a ponytail or a sidepart. Anytime around [5 O'clock] (time) is fine on friday.",
  "i am looking for something different like a ponytail or a sidepart. Anytime around 5 O'clock is fine on [friday] (dayofweek).",
  "can i have a [ponytail] (haircut_style) on friday in the morning at 5 or 5 am?",
  "can i have a ponytail on [friday] (dayofweek) in the morning at 5 or 5 am?",
  "can i have a ponytail on friday in the [morning] (time) at 5 or 5 am?",
  "can i have a ponytail on friday in the morning at 5 or [5 am] (time)?",
  "Hey, I would a [ponytail] (haircut_style) on friday. Can you create an appointment for me please. I am free in the morning so 5 am to 6 am can work for me",
  "Hey, I would a ponytail on [friday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 5 am to 6 am can work for me",
  "Hey, I would a ponytail on friday. Can you create an appointment for me please. I am free in the morning so [5 am] (time) to 6 am can work for me",
  "Hey, I would a ponytail on friday. Can you create an appointment for me please. I am free in the morning so 5 am to [6 am] (time) can work for me",
  "Hey, I would to [ponytail] (haircut_style) the side on friday. Can you create an appointment for me please. I am free in the morning so 5 am to 6 am can work for me",
  "Hey, I would to ponytail the side on [friday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 5 am to 6 am can work for me",
  "Hey, I would to ponytail the side on friday. Can you create an appointment for me please. I am free in the [morning] (time) so 5 am to 6 am can work for me",
  "Hey, I would to ponytail the side on friday. Can you create an appointment for me please. I am free in the morning so 5 am to [6 am] (time) can work for me",
  "Hey, I would to ponytail the side on friday. Can you create an appointment for me please. I am free in the morning so [5 am] (time) to 6 am can work for me",
  "Please create an appointment next week [friday] (dayofweek) at 5 pm for me. I have to fix my ponytail and take a fade.",
  "Please create an appointment next week friday at [5 pm] (time) for me. I have to fix my ponytail and take a fade.",
  "Please create an appointment next week friday at 5 pm for me. I have to fix my [ponytail] (haircut_style) and take a fade.",
  "Please create an appointment next week friday at 5 pm for me. I have to fix my ponytail and take a [fade] (haircut_style).",
  "I would like a [ponytail] (haircut_style) at 5:00 pm on friday",
  "I would like a ponytail at [5:00 pm] (time) on friday",
  "I would like a ponytail at 5:00 pm on [friday] (dayofweek)",
  "I would like a [sidepart] (haircut_style) at 6:30 pm",
  "I would like a sidepart at [6:30 pm] (time)",
  "I just need a [sidepart] (haircut_style) on saturday at 6 pm",
  "I just need a sidepart on [saturday] (dayofweek) at 6 pm",
  "I just need a sidepart on saturday at [6 pm] (time)",
  "I need a [sidepart] (haircut_style) at 6:30 pm on saturday",
  "I need a sidepart at [6:30 pm] (time) on saturday",
  "I need a sidepart at 6:30 pm on [saturday] (dayofweek)",
  "I am thinking about a [sidepart] (haircut_style). I would like to cut on saturday at 6 O'clock",
  "I am thinking about a sidepart. I would like to cut on [saturday] (dayofweek) at 6 O'clock",
  "I am thinking about a sidepart. I would like to cut on saturday at [6 O'clock] (time)",
  "I am thinking about a [sidepart] (haircut_style). I would like to cut on saturday at 6 O'clock",
  "I am thinking about a sidepart. I would like to cut on [saturday] (dayofweek) at 6 O'clock",
  "I am thinking about a sidepart. I would like to cut on saturday at [6 O'clock] (time)",
  "I am thinking about a [sidepart] (haircut_style). I would like to cut on saturday at 6 O'clock",
  "I am thinking about a sidepart. I would like to cut on [saturday] (dayofweek) at 6 O'clock",
  "I am thinking about a sidepart. I would like to cut on saturday at [6 O'clock] (time)",
  "I will go with a [sidepart] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like saturday at 6:30 pm",
  "I will go with a sidepart. My girlfriend really like that. Can we do it as soon as possible like [saturday] (dayofweek) at 6:30 pm",
  "I will go with a sidepart. My girlfriend really like that. Can we do it as soon as possible like saturday at [6:30 pm] (time)",
  "I will go with a [sidepart] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like saturday at 6:30 pm",
  "I will go with a sidepart. My girlfriend really like that. Can we do it as soon as possible like [saturday] (dayofweek) at 6:30 pm",
  "I will go with a sidepart. My girlfriend really like that. Can we do it as soon as possible like saturday at [6:30 pm] (time)",
  "I will go with a [sidepart] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like saturday at 6:30 pm",
  "I will go with a sidepart. My girlfriend really like that. Can we do it as soon as possible like [saturday] (dayofweek) at 6:30 pm",
  "I will go with a sidepart. My girlfriend really like that. Can we do it as soon as possible like saturday at [6:30 pm] (time)",
  "i am looking for something funny like a [sidepart] (haircut_style). Can we do it at 6 O'clock on saturday.",
  "i am looking for something funny like a sidepart. Can we do it at [6 O'clock] (time) on saturday.",
  "i am looking for something funny like a sidepart. Can we do it at 6 O'clock on [saturday] (dayofweek).",
  "Hey, please create an appointment to cut my hair on [saturday] (dayofweek) around 6 O'clock in the morning. I just need a sidepart",
  "Hey, please create an appointment to cut my hair on saturday around [6 O'clock in the morning] (time). I just need a sidepart",
  "Hey, please create an appointment to cut my hair on saturday around 6 O'clock in the morning. I just need a [sidepart] (haircut_style)",
  "my son needs a hair cut. He will be taking the usually cut, a [sidepart] (haircut_style). Same time as well, saturday at 6 pm. If 6 pm is not available, i can do 6 pm",
  "my son needs a hair cut. He will be taking the usually cut, a sidepart. Same time as well, [saturday] (dayofweek) at 6 pm. If 6 pm is not available, i can do 6 pm",
  "my son needs a hair cut. He will be taking the usually cut, a sidepart. Same time as well, saturday at [6 pm] (time). If [6 pm] (time) is not available, i can do [6 pm] (time)",
  "my son needs a hair cut. He will be taking the usually cut, a sidepart. Same time as well, saturday at [6 pm] (time). If [6 pm] (time) is not available, i can do [6 pm] (time)",
  "I need a [sidepart] (haircut_style) before saturday. Anytime in the afternoon like 6:30 pm is good",
  "I need a sidepart before [saturday] (dayofweek). Anytime in the afternoon like 6:30 pm is good",
  "I need a sidepart before saturday. Anytime in the [afternoon] (time) like 6:30 pm is good",
  "I need a sidepart before saturday. Anytime in the afternoon like [6:30 pm] (time) is good",
  "My son need a haircut at [ 6 pm] (time) tomorrow. He will be taking the usual a sidepart",
  "My son need a haircut at  6 pm [tomorrow] (dayofweek). He will be taking the usual a sidepart",
  "My son need a haircut at  6 pm tomorrow. He will be taking the usual a [sidepart] (haircut_style)",
  "my hair needs to cut. When is the earliest i can have a [sidepart] (haircut_style). I am only available in the morning",
  "my hair needs to cut. When is the [earliest] (dayofweek) i can have a sidepart. I am only available in the morning",
  "my hair needs to cut. When is the earliest i can have a sidepart. I am only available in the [morning] (time)",
  "[Next week] (dayofweek) saturday the 6 i need sidepart. Anytime is good for me, but I prefer the afternoon",
  "Next week [saturday] (dayofweek) the 6 i need sidepart. Anytime is good for me, but I prefer the afternoon",
  "Next week saturday the 6 i need [sidepart] (haircut_style). Anytime is good for me, but I prefer the afternoon",
  "Next week saturday the 6 i need sidepart. Anytime is good for me, but I prefer the [afternoon] (time)",
  "Next week saturday the 6 i need sidepart. [Anytime] (time) is good for me, but I prefer the afternoon",
  "[6 pm] (time) on saturday is fine",
  "6 pm on [saturday] (dayofweek) is fine",
  "I would like a [sidepart] (haircut_style) at 6:00 pm on saturday",
  "I would like a sidepart at [6:00 pm] (time) on saturday",
  "I would like a sidepart at 6:00 pm on [saturday] (dayofweek)",
  "Please create an appointment next week [saturday] (dayofweek) at 6 pm for me. I want to take a fade and a sidepart.",
  "Please create an appointment next week saturday at [6 pm] (time) for me. I want to take a fade and a sidepart.",
  "Please create an appointment next week saturday at 6 pm for me. I want to take a [fade] (haircut_style) and a sidepart.",
  "Please create an appointment next week saturday at 6 pm for me. I want to take a fade and a [sidepart] (haircut_style).",
  "my hair needs a trim. When is the earliest i can have a [sidepart] (haircut_style). I am only available in the morning on saturday",
  "my hair needs a trim. When is the earliest i can have a sidepart. I am only available in the morning on [saturday] (dayofweek)",
  "I would like a [sidepart] (haircut_style) at 6 pm on saturday",
  "I would like a sidepart at [6 pm] (time) on saturday",
  "I would like a sidepart at 6 pm on [saturday] (dayofweek)",
  "I just need a [sidepart] (haircut_style) on saturday at 6 pm",
  "I just need a sidepart on [saturday] (dayofweek) at 6 pm",
  "I just need a sidepart on saturday at [6 pm] (time)",
  "My son need a haircut_style at  [6 pm] (time) tomorrow. He will be taking the usual sidepart on saturday",
  "My son need a haircut_style at  6 pm tomorrow. He will be taking the usual [sidepart] (haircut_style) on saturday",
  "My son need a haircut_style at  6 pm tomorrow. He will be taking the usual sidepart on [saturday] (dayofweek)",
  "i want [sidepart] (haircut_style). saturday is a good day to cut my hair at 6 pm",
  "i want sidepart. [saturday] (dayofweek) is a good day to cut my hair at 6 pm",
  "i want sidepart. saturday is a good day to cut my hair at [6 pm] (time)",
  "The day i want to cut my hair is [saturday] (dayofweek). I need a sidepart at 6 pm",
  "The day i want to cut my hair is saturday. I need a [sidepart] (haircut_style) at 6 pm",
  "The day i want to cut my hair is saturday. I need a sidepart at [6 pm] (time)",
  "I am free [saturday] (dayofweek) and i am looking for a haircut. I am thinking about a sidepart. The time i want to cut it is 6 pm",
  "I am free saturday and i am looking for a haircut. I am thinking about a [sidepart] (haircut_style). The time i want to cut it is 6 pm",
  "I am free saturday and i am looking for a haircut. I am thinking about a sidepart. The time i want to cut it is [6 pm] (time)",
  "[saturday] (dayofweek) is a good day to cut my hair. I want a sidepart at 6 pm",
  "saturday is a good day to cut my hair. I want a [sidepart] (haircut_style) at 6 pm",
  "saturday is a good day to cut my hair. I want a sidepart at [6 pm] (time)",
  "Next week [saturday] (dayofweek) i want to get a sidepart at 6 pm",
  "Next week saturday i want to get a [sidepart] (haircut_style) at 6 pm",
  "Next week saturday i want to get a sidepart at [6 pm] (time)",
  "On [saturday] (dayofweek) 13. I want to get a sidepart at 6 pm",
  "On saturday 13. I want to get a [sidepart] (haircut_style) at 6 pm",
  "On saturday 13. I want to get a sidepart at [6 pm] (time)",
  "I will take a [sidepart] (haircut_style) saturday at 6 pm",
  "I will take a sidepart [saturday] (dayofweek) at 6 pm",
  "I will take a sidepart saturday at [6 pm] (time)",
  "I am going to the barber on [saturday] (dayofweek) at 6 pm for a sidepart",
  "I am going to the barber on saturday at [6 pm] (time) for a sidepart",
  "I am going to the barber on saturday at 6 pm for a [sidepart] (haircut_style)",
  "[saturday] (dayofweek) coming is when i will take a sidepart. The time i am free is 6 pm",
  "saturday coming is when i will take a [sidepart] (haircut_style). The time i am free is 6 pm",
  "saturday coming is when i will take a sidepart. The time i am free is [6 pm] (time)",
  "[saturday] (dayofweek) is a good day",
  "i would like a [sidepart] (haircut_style) hairstyle",
  "I am free on [saturday] (dayofweek)",
  "[saturday] (dayofweek) can work for me",
  "i need a [sidepart] (haircut_style) haircut",
  "I need a trim and a [sidepart] (haircut_style) tomorrow at 6 pm. If it's not available next saturday in the afternoon around 6",
  "I need a trim and a sidepart tomorrow at [6 pm] (time). If it's not available next saturday in the afternoon around 6",
  "I need a trim and a sidepart tomorrow at 6 pm. If it's not available next [saturday] (dayofweek) in the afternoon around 6",
  "I need a trim and a sidepart tomorrow at 6 pm. If it's not available next saturday in the [afternoon] (time) around 6",
  "Can you give me a [sidepart] (haircut_style) or bowlcut. I can go for saturday or sunday around 6 in the morning",
  "Can you give me a sidepart or [bowlcut] (haircut_style). I can go for saturday or sunday around 6 in the morning",
  "Can you give me a sidepart or bowlcut. I can go for [saturday] (dayofweek) or sunday around 6 in the morning",
  "Can you give me a sidepart or bowlcut. I can go for saturday or [sunday] (dayofweek) around 6 in the morning",
  "Can you give me a sidepart or bowlcut. I can go for saturday or sunday around 6 in the [morning] (time)",
  "I just want a [sidepart] (haircut_style), nothing too fancy. will tomorrow around 6 in the afternoon work",
  "I just want a sidepart, nothing too fancy. will [tomorrow] (dayofweek) around 6 in the afternoon work",
  "I just want a sidepart, nothing too fancy. will tomorrow around 6 in the [afternoon] (time) work",
  "i am looking for something different like a [sidepart] (haircut_style) or a bowlcut. Anytime around 6 O'clock is fine on saturday.",
  "i am looking for something different like a sidepart or a [bowlcut] (haircut_style). Anytime around 6 O'clock is fine on saturday.",
  "i am looking for something different like a sidepart or a bowlcut. Anytime around [6 O'clock] (time) is fine on saturday.",
  "i am looking for something different like a sidepart or a bowlcut. Anytime around 6 O'clock is fine on [saturday] (dayofweek).",
  "can i have a [sidepart] (haircut_style) on saturday in the morning at 6 or 6 am?",
  "can i have a sidepart on [saturday] (dayofweek) in the morning at 6 or 6 am?",
  "can i have a sidepart on saturday in the [morning] (time) at 6 or 6 am?",
  "can i have a sidepart on saturday in the morning at 6 or [6 am] (time)?",
  "Hey, I would a [sidepart] (haircut_style) on saturday. Can you create an appointment for me please. I am free in the morning so 6 am to 7 am can work for me",
  "Hey, I would a sidepart on [saturday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 6 am to 7 am can work for me",
  "Hey, I would a sidepart on saturday. Can you create an appointment for me please. I am free in the morning so [6 am] (time) to 7 am can work for me",
  "Hey, I would a sidepart on saturday. Can you create an appointment for me please. I am free in the morning so 6 am to [7 am] (time) can work for me",
  "Hey, I would to [sidepart] (haircut_style) the side on saturday. Can you create an appointment for me please. I am free in the morning so 6 am to 7 am can work for me",
  "Hey, I would to sidepart the side on [saturday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 6 am to 7 am can work for me",
  "Hey, I would to sidepart the side on saturday. Can you create an appointment for me please. I am free in the [morning] (time) so 6 am to 7 am can work for me",
  "Hey, I would to sidepart the side on saturday. Can you create an appointment for me please. I am free in the morning so 6 am to [7 am] (time) can work for me",
  "Hey, I would to sidepart the side on saturday. Can you create an appointment for me please. I am free in the morning so [6 am] (time) to 7 am can work for me",
  "Please create an appointment next week [saturday] (dayofweek) at 6 pm for me. I have to fix my sidepart and take a fade.",
  "Please create an appointment next week saturday at [6 pm] (time) for me. I have to fix my sidepart and take a fade.",
  "Please create an appointment next week saturday at 6 pm for me. I have to fix my [sidepart] (haircut_style) and take a fade.",
  "Please create an appointment next week saturday at 6 pm for me. I have to fix my sidepart and take a [fade] (haircut_style).",
  "I would like a [sidepart] (haircut_style) at 6:00 pm on saturday",
  "I would like a sidepart at [6:00 pm] (time) on saturday",
  "I would like a sidepart at 6:00 pm on [saturday] (dayofweek)",
  "I would like a [bowlcut] (haircut_style) at 7:30 pm",
  "I would like a bowlcut at [7:30 pm] (time)",
  "I just need a [bowlcut] (haircut_style) on sunday at 7 pm",
  "I just need a bowlcut on [sunday] (dayofweek) at 7 pm",
  "I just need a bowlcut on sunday at [7 pm] (time)",
  "I need a [bowlcut] (haircut_style) at 7:30 pm on sunday",
  "I need a bowlcut at [7:30 pm] (time) on sunday",
  "I need a bowlcut at 7:30 pm on [sunday] (dayofweek)",
  "I am thinking about a [bowlcut] (haircut_style). I would like to cut on sunday at 7 O'clock",
  "I am thinking about a bowlcut. I would like to cut on [sunday] (dayofweek) at 7 O'clock",
  "I am thinking about a bowlcut. I would like to cut on sunday at [7 O'clock] (time)",
  "I am thinking about a [bowlcut] (haircut_style). I would like to cut on sunday at 7 O'clock",
  "I am thinking about a bowlcut. I would like to cut on [sunday] (dayofweek) at 7 O'clock",
  "I am thinking about a bowlcut. I would like to cut on sunday at [7 O'clock] (time)",
  "I am thinking about a [bowlcut] (haircut_style). I would like to cut on sunday at 7 O'clock",
  "I am thinking about a bowlcut. I would like to cut on [sunday] (dayofweek) at 7 O'clock",
  "I am thinking about a bowlcut. I would like to cut on sunday at [7 O'clock] (time)",
  "I will go with a [bowlcut] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like sunday at 7:30 pm",
  "I will go with a bowlcut. My girlfriend really like that. Can we do it as soon as possible like [sunday] (dayofweek) at 7:30 pm",
  "I will go with a bowlcut. My girlfriend really like that. Can we do it as soon as possible like sunday at [7:30 pm] (time)",
  "I will go with a [bowlcut] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like sunday at 7:30 pm",
  "I will go with a bowlcut. My girlfriend really like that. Can we do it as soon as possible like [sunday] (dayofweek) at 7:30 pm",
  "I will go with a bowlcut. My girlfriend really like that. Can we do it as soon as possible like sunday at [7:30 pm] (time)",
  "I will go with a [bowlcut] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like sunday at 7:30 pm",
  "I will go with a bowlcut. My girlfriend really like that. Can we do it as soon as possible like [sunday] (dayofweek) at 7:30 pm",
  "I will go with a bowlcut. My girlfriend really like that. Can we do it as soon as possible like sunday at [7:30 pm] (time)",
  "i am looking for something funny like a [bowlcut] (haircut_style). Can we do it at 7 O'clock on sunday.",
  "i am looking for something funny like a bowlcut. Can we do it at [7 O'clock] (time) on sunday.",
  "i am looking for something funny like a bowlcut. Can we do it at 7 O'clock on [sunday] (dayofweek).",
  "Hey, please create an appointment to cut my hair on [sunday] (dayofweek) around 7 O'clock in the morning. I just need a bowlcut",
  "Hey, please create an appointment to cut my hair on sunday around [7 O'clock in the morning] (time). I just need a bowlcut",
  "Hey, please create an appointment to cut my hair on sunday around 7 O'clock in the morning. I just need a [bowlcut] (haircut_style)",
  "my son needs a hair cut. He will be taking the usually cut, a [bowlcut] (haircut_style). Same time as well, sunday at 7 pm. If 7 pm is not available, i can do 7 pm",
  "my son needs a hair cut. He will be taking the usually cut, a bowlcut. Same time as well, [sunday] (dayofweek) at 7 pm. If 7 pm is not available, i can do 7 pm",
  "my son needs a hair cut. He will be taking the usually cut, a bowlcut. Same time as well, sunday at [7 pm] (time). If [7 pm] (time) is not available, i can do [7 pm] (time)",
  "my son needs a hair cut. He will be taking the usually cut, a bowlcut. Same time as well, sunday at [7 pm] (time). If [7 pm] (time) is not available, i can do [7 pm] (time)",
  "I need a [bowlcut] (haircut_style) before sunday. Anytime in the afternoon like 7:30 pm is good",
  "I need a bowlcut before [sunday] (dayofweek). Anytime in the afternoon like 7:30 pm is good",
  "I need a bowlcut before sunday. Anytime in the [afternoon] (time) like 7:30 pm is good",
  "I need a bowlcut before sunday. Anytime in the afternoon like [7:30 pm] (time) is good",
  "My son need a haircut at [ 7 pm] (time) tomorrow. He will be taking the usual a bowlcut",
  "My son need a haircut at  7 pm [tomorrow] (dayofweek). He will be taking the usual a bowlcut",
  "My son need a haircut at  7 pm tomorrow. He will be taking the usual a [bowlcut] (haircut_style)",
  "my hair needs to cut. When is the earliest i can have a [bowlcut] (haircut_style). I am only available in the morning",
  "my hair needs to cut. When is the [earliest] (dayofweek) i can have a bowlcut. I am only available in the morning",
  "my hair needs to cut. When is the earliest i can have a bowlcut. I am only available in the [morning] (time)",
  "[Next week] (dayofweek) sunday the 7 i need bowlcut. Anytime is good for me, but I prefer the afternoon",
  "Next week [sunday] (dayofweek) the 7 i need bowlcut. Anytime is good for me, but I prefer the afternoon",
  "Next week sunday the 7 i need [bowlcut] (haircut_style). Anytime is good for me, but I prefer the afternoon",
  "Next week sunday the 7 i need bowlcut. Anytime is good for me, but I prefer the [afternoon] (time)",
  "Next week sunday the 7 i need bowlcut. [Anytime] (time) is good for me, but I prefer the afternoon",
  "[7 pm] (time) on sunday is fine",
  "7 pm on [sunday] (dayofweek) is fine",
  "I would like a [bowlcut] (haircut_style) at 7:00 pm on sunday",
  "I would like a bowlcut at [7:00 pm] (time) on sunday",
  "I would like a bowlcut at 7:00 pm on [sunday] (dayofweek)",
  "Please create an appointment next week [sunday] (dayofweek) at 7 pm for me. I want to take a fade and a bowlcut.",
  "Please create an appointment next week sunday at [7 pm] (time) for me. I want to take a fade and a bowlcut.",
  "Please create an appointment next week sunday at 7 pm for me. I want to take a [fade] (haircut_style) and a bowlcut.",
  "Please create an appointment next week sunday at 7 pm for me. I want to take a fade and a [bowlcut] (haircut_style).",
  "my hair needs a trim. When is the earliest i can have a [bowlcut] (haircut_style). I am only available in the morning on sunday",
  "my hair needs a trim. When is the earliest i can have a bowlcut. I am only available in the morning on [sunday] (dayofweek)",
  "I would like a [bowlcut] (haircut_style) at 7 pm on sunday",
  "I would like a bowlcut at [7 pm] (time) on sunday",
  "I would like a bowlcut at 7 pm on [sunday] (dayofweek)",
  "I just need a [bowlcut] (haircut_style) on sunday at 7 pm",
  "I just need a bowlcut on [sunday] (dayofweek) at 7 pm",
  "I just need a bowlcut on sunday at [7 pm] (time)",
  "My son need a haircut_style at  [7 pm] (time) tomorrow. He will be taking the usual bowlcut on sunday",
  "My son need a haircut_style at  7 pm tomorrow. He will be taking the usual [bowlcut] (haircut_style) on sunday",
  "My son need a haircut_style at  7 pm tomorrow. He will be taking the usual bowlcut on [sunday] (dayofweek)",
  "i want [bowlcut] (haircut_style). sunday is a good day to cut my hair at 7 pm",
  "i want bowlcut. [sunday] (dayofweek) is a good day to cut my hair at 7 pm",
  "i want bowlcut. sunday is a good day to cut my hair at [7 pm] (time)",
  "The day i want to cut my hair is [sunday] (dayofweek). I need a bowlcut at 7 pm",
  "The day i want to cut my hair is sunday. I need a [bowlcut] (haircut_style) at 7 pm",
  "The day i want to cut my hair is sunday. I need a bowlcut at [7 pm] (time)",
  "I am free [sunday] (dayofweek) and i am looking for a haircut. I am thinking about a bowlcut. The time i want to cut it is 7 pm",
  "I am free sunday and i am looking for a haircut. I am thinking about a [bowlcut] (haircut_style). The time i want to cut it is 7 pm",
  "I am free sunday and i am looking for a haircut. I am thinking about a bowlcut. The time i want to cut it is [7 pm] (time)",
  "[sunday] (dayofweek) is a good day to cut my hair. I want a bowlcut at 7 pm",
  "sunday is a good day to cut my hair. I want a [bowlcut] (haircut_style) at 7 pm",
  "sunday is a good day to cut my hair. I want a bowlcut at [7 pm] (time)",
  "Next week [sunday] (dayofweek) i want to get a bowlcut at 7 pm",
  "Next week sunday i want to get a [bowlcut] (haircut_style) at 7 pm",
  "Next week sunday i want to get a bowlcut at [7 pm] (time)",
  "On [sunday] (dayofweek) 13. I want to get a bowlcut at 7 pm",
  "On sunday 13. I want to get a [bowlcut] (haircut_style) at 7 pm",
  "On sunday 13. I want to get a bowlcut at [7 pm] (time)",
  "I will take a [bowlcut] (haircut_style) sunday at 7 pm",
  "I will take a bowlcut [sunday] (dayofweek) at 7 pm",
  "I will take a bowlcut sunday at [7 pm] (time)",
  "I am going to the barber on [sunday] (dayofweek) at 7 pm for a bowlcut",
  "I am going to the barber on sunday at [7 pm] (time) for a bowlcut",
  "I am going to the barber on sunday at 7 pm for a [bowlcut] (haircut_style)",
  "[sunday] (dayofweek) coming is when i will take a bowlcut. The time i am free is 7 pm",
  "sunday coming is when i will take a [bowlcut] (haircut_style). The time i am free is 7 pm",
  "sunday coming is when i will take a bowlcut. The time i am free is [7 pm] (time)",
  "[sunday] (dayofweek) is a good day",
  "i would like a [bowlcut] (haircut_style) hairstyle",
  "I am free on [sunday] (dayofweek)",
  "[sunday] (dayofweek) can work for me",
  "i need a [bowlcut] (haircut_style) haircut",
  "I need a trim and a [bowlcut] (haircut_style) tomorrow at 7 pm. If it's not available next sunday in the afternoon around 7",
  "I need a trim and a bowlcut tomorrow at [7 pm] (time). If it's not available next sunday in the afternoon around 7",
  "I need a trim and a bowlcut tomorrow at 7 pm. If it's not available next [sunday] (dayofweek) in the afternoon around 7",
  "I need a trim and a bowlcut tomorrow at 7 pm. If it's not available next sunday in the [afternoon] (time) around 7",
  "Can you give me a [bowlcut] (haircut_style) or taper. I can go for sunday or monday around 7 in the morning",
  "Can you give me a bowlcut or [taper] (haircut_style). I can go for sunday or monday around 7 in the morning",
  "Can you give me a bowlcut or taper. I can go for [sunday] (dayofweek) or monday around 7 in the morning",
  "Can you give me a bowlcut or taper. I can go for sunday or [monday] (dayofweek) around 7 in the morning",
  "Can you give me a bowlcut or taper. I can go for sunday or monday around 7 in the [morning] (time)",
  "I just want a [bowlcut] (haircut_style), nothing too fancy. will tomorrow around 7 in the afternoon work",
  "I just want a bowlcut, nothing too fancy. will [tomorrow] (dayofweek) around 7 in the afternoon work",
  "I just want a bowlcut, nothing too fancy. will tomorrow around 7 in the [afternoon] (time) work",
  "i am looking for something different like a [bowlcut] (haircut_style) or a taper. Anytime around 7 O'clock is fine on sunday.",
  "i am looking for something different like a bowlcut or a [taper] (haircut_style). Anytime around 7 O'clock is fine on sunday.",
  "i am looking for something different like a bowlcut or a taper. Anytime around [7 O'clock] (time) is fine on sunday.",
  "i am looking for something different like a bowlcut or a taper. Anytime around 7 O'clock is fine on [sunday] (dayofweek).",
  "can i have a [bowlcut] (haircut_style) on sunday in the morning at 7 or 7 am?",
  "can i have a bowlcut on [sunday] (dayofweek) in the morning at 7 or 7 am?",
  "can i have a bowlcut on sunday in the [morning] (time) at 7 or 7 am?",
  "can i have a bowlcut on sunday in the morning at 7 or [7 am] (time)?",
  "Hey, I would a [bowlcut] (haircut_style) on sunday. Can you create an appointment for me please. I am free in the morning so 7 am to 8 am can work for me",
  "Hey, I would a bowlcut on [sunday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 7 am to 8 am can work for me",
  "Hey, I would a bowlcut on sunday. Can you create an appointment for me please. I am free in the morning so [7 am] (time) to 8 am can work for me",
  "Hey, I would a bowlcut on sunday. Can you create an appointment for me please. I am free in the morning so 7 am to [8 am] (time) can work for me",
  "Hey, I would to [bowlcut] (haircut_style) the side on sunday. Can you create an appointment for me please. I am free in the morning so 7 am to 8 am can work for me",
  "Hey, I would to bowlcut the side on [sunday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 7 am to 8 am can work for me",
  "Hey, I would to bowlcut the side on sunday. Can you create an appointment for me please. I am free in the [morning] (time) so 7 am to 8 am can work for me",
  "Hey, I would to bowlcut the side on sunday. Can you create an appointment for me please. I am free in the morning so 7 am to [8 am] (time) can work for me",
  "Hey, I would to bowlcut the side on sunday. Can you create an appointment for me please. I am free in the morning so [7 am] (time) to 8 am can work for me",
  "Please create an appointment next week [sunday] (dayofweek) at 7 pm for me. I have to fix my bowlcut and take a fade.",
  "Please create an appointment next week sunday at [7 pm] (time) for me. I have to fix my bowlcut and take a fade.",
  "Please create an appointment next week sunday at 7 pm for me. I have to fix my [bowlcut] (haircut_style) and take a fade.",
  "Please create an appointment next week sunday at 7 pm for me. I have to fix my bowlcut and take a [fade] (haircut_style).",
  "I would like a [bowlcut] (haircut_style) at 7:00 pm on sunday",
  "I would like a bowlcut at [7:00 pm] (time) on sunday",
  "I would like a bowlcut at 7:00 pm on [sunday] (dayofweek)",
  "I would like a [taper] (haircut_style) at 8:30 pm",
  "I would like a taper at [8:30 pm] (time)",
  "I just need a [taper] (haircut_style) on monday at 8 pm",
  "I just need a taper on [monday] (dayofweek) at 8 pm",
  "I just need a taper on monday at [8 pm] (time)",
  "I need a [taper] (haircut_style) at 8:30 pm on monday",
  "I need a taper at [8:30 pm] (time) on monday",
  "I need a taper at 8:30 pm on [monday] (dayofweek)",
  "I am thinking about a [taper] (haircut_style). I would like to cut on monday at 8 O'clock",
  "I am thinking about a taper. I would like to cut on [monday] (dayofweek) at 8 O'clock",
  "I am thinking about a taper. I would like to cut on monday at [8 O'clock] (time)",
  "I am thinking about a [taper] (haircut_style). I would like to cut on monday at 8 O'clock",
  "I am thinking about a taper. I would like to cut on [monday] (dayofweek) at 8 O'clock",
  "I am thinking about a taper. I would like to cut on monday at [8 O'clock] (time)",
  "I am thinking about a [taper] (haircut_style). I would like to cut on monday at 8 O'clock",
  "I am thinking about a taper. I would like to cut on [monday] (dayofweek) at 8 O'clock",
  "I am thinking about a taper. I would like to cut on monday at [8 O'clock] (time)",
  "I will go with a [taper] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like monday at 8:30 pm",
  "I will go with a taper. My girlfriend really like that. Can we do it as soon as possible like [monday] (dayofweek) at 8:30 pm",
  "I will go with a taper. My girlfriend really like that. Can we do it as soon as possible like monday at [8:30 pm] (time)",
  "I will go with a [taper] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like monday at 8:30 pm",
  "I will go with a taper. My girlfriend really like that. Can we do it as soon as possible like [monday] (dayofweek) at 8:30 pm",
  "I will go with a taper. My girlfriend really like that. Can we do it as soon as possible like monday at [8:30 pm] (time)",
  "I will go with a [taper] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like monday at 8:30 pm",
  "I will go with a taper. My girlfriend really like that. Can we do it as soon as possible like [monday] (dayofweek) at 8:30 pm",
  "I will go with a taper. My girlfriend really like that. Can we do it as soon as possible like monday at [8:30 pm] (time)",
  "i am looking for something funny like a [taper] (haircut_style). Can we do it at 8 O'clock on monday.",
  "i am looking for something funny like a taper. Can we do it at [8 O'clock] (time) on monday.",
  "i am looking for something funny like a taper. Can we do it at 8 O'clock on [monday] (dayofweek).",
  "Hey, please create an appointment to cut my hair on [monday] (dayofweek) around 8 O'clock in the morning. I just need a taper",
  "Hey, please create an appointment to cut my hair on monday around [8 O'clock in the morning] (time). I just need a taper",
  "Hey, please create an appointment to cut my hair on monday around 8 O'clock in the morning. I just need a [taper] (haircut_style)",
  "my son needs a hair cut. He will be taking the usually cut, a [taper] (haircut_style). Same time as well, monday at 8 pm. If 8 pm is not available, i can do 8 pm",
  "my son needs a hair cut. He will be taking the usually cut, a taper. Same time as well, [monday] (dayofweek) at 8 pm. If 8 pm is not available, i can do 8 pm",
  "my son needs a hair cut. He will be taking the usually cut, a taper. Same time as well, monday at [8 pm] (time). If [8 pm] (time) is not available, i can do [8 pm] (time)",
  "my son needs a hair cut. He will be taking the usually cut, a taper. Same time as well, monday at [8 pm] (time). If [8 pm] (time) is not available, i can do [8 pm] (time)",
  "I need a [taper] (haircut_style) before monday. Anytime in the afternoon like 8:30 pm is good",
  "I need a taper before [monday] (dayofweek). Anytime in the afternoon like 8:30 pm is good",
  "I need a taper before monday. Anytime in the [afternoon] (time) like 8:30 pm is good",
  "I need a taper before monday. Anytime in the afternoon like [8:30 pm] (time) is good",
  "My son need a haircut at [ 8 pm] (time) tomorrow. He will be taking the usual a taper",
  "My son need a haircut at  8 pm [tomorrow] (dayofweek). He will be taking the usual a taper",
  "My son need a haircut at  8 pm tomorrow. He will be taking the usual a [taper] (haircut_style)",
  "my hair needs to cut. When is the earliest i can have a [taper] (haircut_style). I am only available in the morning",
  "my hair needs to cut. When is the [earliest] (dayofweek) i can have a taper. I am only available in the morning",
  "my hair needs to cut. When is the earliest i can have a taper. I am only available in the [morning] (time)",
  "[Next week] (dayofweek) monday the 8 i need taper. Anytime is good for me, but I prefer the afternoon",
  "Next week [monday] (dayofweek) the 8 i need taper. Anytime is good for me, but I prefer the afternoon",
  "Next week monday the 8 i need [taper] (haircut_style). Anytime is good for me, but I prefer the afternoon",
  "Next week monday the 8 i need taper. Anytime is good for me, but I prefer the [afternoon] (time)",
  "Next week monday the 8 i need taper. [Anytime] (time) is good for me, but I prefer the afternoon",
  "[8 pm] (time) on monday is fine",
  "8 pm on [monday] (dayofweek) is fine",
  "I would like a [taper] (haircut_style) at 8:00 pm on monday",
  "I would like a taper at [8:00 pm] (time) on monday",
  "I would like a taper at 8:00 pm on [monday] (dayofweek)",
  "Please create an appointment next week [monday] (dayofweek) at 8 pm for me. I want to take a fade and a taper.",
  "Please create an appointment next week monday at [8 pm] (time) for me. I want to take a fade and a taper.",
  "Please create an appointment next week monday at 8 pm for me. I want to take a [fade] (haircut_style) and a taper.",
  "Please create an appointment next week monday at 8 pm for me. I want to take a fade and a [taper] (haircut_style).",
  "my hair needs a trim. When is the earliest i can have a [taper] (haircut_style). I am only available in the morning on monday",
  "my hair needs a trim. When is the earliest i can have a taper. I am only available in the morning on [monday] (dayofweek)",
  "I would like a [taper] (haircut_style) at 8 pm on monday",
  "I would like a taper at [8 pm] (time) on monday",
  "I would like a taper at 8 pm on [monday] (dayofweek)",
  "I just need a [taper] (haircut_style) on monday at 8 pm",
  "I just need a taper on [monday] (dayofweek) at 8 pm",
  "I just need a taper on monday at [8 pm] (time)",
  "My son need a haircut_style at  [8 pm] (time) tomorrow. He will be taking the usual taper on monday",
  "My son need a haircut_style at  8 pm tomorrow. He will be taking the usual [taper] (haircut_style) on monday",
  "My son need a haircut_style at  8 pm tomorrow. He will be taking the usual taper on [monday] (dayofweek)",
  "i want [taper] (haircut_style). monday is a good day to cut my hair at 8 pm",
  "i want taper. [monday] (dayofweek) is a good day to cut my hair at 8 pm",
  "i want taper. monday is a good day to cut my hair at [8 pm] (time)",
  "The day i want to cut my hair is [monday] (dayofweek). I need a taper at 8 pm",
  "The day i want to cut my hair is monday. I need a [taper] (haircut_style) at 8 pm",
  "The day i want to cut my hair is monday. I need a taper at [8 pm] (time)",
  "I am free [monday] (dayofweek) and i am looking for a haircut. I am thinking about a taper. The time i want to cut it is 8 pm",
  "I am free monday and i am looking for a haircut. I am thinking about a [taper] (haircut_style). The time i want to cut it is 8 pm",
  "I am free monday and i am looking for a haircut. I am thinking about a taper. The time i want to cut it is [8 pm] (time)",
  "[monday] (dayofweek) is a good day to cut my hair. I want a taper at 8 pm",
  "monday is a good day to cut my hair. I want a [taper] (haircut_style) at 8 pm",
  "monday is a good day to cut my hair. I want a taper at [8 pm] (time)",
  "Next week [monday] (dayofweek) i want to get a taper at 8 pm",
  "Next week monday i want to get a [taper] (haircut_style) at 8 pm",
  "Next week monday i want to get a taper at [8 pm] (time)",
  "On [monday] (dayofweek) 13. I want to get a taper at 8 pm",
  "On monday 13. I want to get a [taper] (haircut_style) at 8 pm",
  "On monday 13. I want to get a taper at [8 pm] (time)",
  "I will take a [taper] (haircut_style) monday at 8 pm",
  "I will take a taper [monday] (dayofweek) at 8 pm",
  "I will take a taper monday at [8 pm] (time)",
  "I am going to the barber on [monday] (dayofweek) at 8 pm for a taper",
  "I am going to the barber on monday at [8 pm] (time) for a taper",
  "I am going to the barber on monday at 8 pm for a [taper] (haircut_style)",
  "[monday] (dayofweek) coming is when i will take a taper. The time i am free is 8 pm",
  "monday coming is when i will take a [taper] (haircut_style). The time i am free is 8 pm",
  "monday coming is when i will take a taper. The time i am free is [8 pm] (time)",
  "[monday] (dayofweek) is a good day",
  "i would like a [taper] (haircut_style) hairstyle",
  "I am free on [monday] (dayofweek)",
  "[monday] (dayofweek) can work for me",
  "i need a [taper] (haircut_style) haircut",
  "I need a trim and a [taper] (haircut_style) tomorrow at 8 pm. If it's not available next monday in the afternoon around 8",
  "I need a trim and a taper tomorrow at [8 pm] (time). If it's not available next monday in the afternoon around 8",
  "I need a trim and a taper tomorrow at 8 pm. If it's not available next [monday] (dayofweek) in the afternoon around 8",
  "I need a trim and a taper tomorrow at 8 pm. If it's not available next monday in the [afternoon] (time) around 8",
  "Can you give me a [taper] (haircut_style) or fade. I can go for monday or tuesday around 8 in the morning",
  "Can you give me a taper or [fade] (haircut_style). I can go for monday or tuesday around 8 in the morning",
  "Can you give me a taper or fade. I can go for [monday] (dayofweek) or tuesday around 8 in the morning",
  "Can you give me a taper or fade. I can go for monday or [tuesday] (dayofweek) around 8 in the morning",
  "Can you give me a taper or fade. I can go for monday or tuesday around 8 in the [morning] (time)",
  "I just want a [taper] (haircut_style), nothing too fancy. will tomorrow around 8 in the afternoon work",
  "I just want a taper, nothing too fancy. will [tomorrow] (dayofweek) around 8 in the afternoon work",
  "I just want a taper, nothing too fancy. will tomorrow around 8 in the [afternoon] (time) work",
  "i am looking for something different like a [taper] (haircut_style) or a fade. Anytime around 8 O'clock is fine on monday.",
  "i am looking for something different like a taper or a [fade] (haircut_style). Anytime around 8 O'clock is fine on monday.",
  "i am looking for something different like a taper or a fade. Anytime around [8 O'clock] (time) is fine on monday.",
  "i am looking for something different like a taper or a fade. Anytime around 8 O'clock is fine on [monday] (dayofweek).",
  "can i have a [taper] (haircut_style) on monday in the morning at 8 or 8 am?",
  "can i have a taper on [monday] (dayofweek) in the morning at 8 or 8 am?",
  "can i have a taper on monday in the [morning] (time) at 8 or 8 am?",
  "can i have a taper on monday in the morning at 8 or [8 am] (time)?",
  "Hey, I would a [taper] (haircut_style) on monday. Can you create an appointment for me please. I am free in the morning so 8 am to 9 am can work for me",
  "Hey, I would a taper on [monday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 8 am to 9 am can work for me",
  "Hey, I would a taper on monday. Can you create an appointment for me please. I am free in the morning so [8 am] (time) to 9 am can work for me",
  "Hey, I would a taper on monday. Can you create an appointment for me please. I am free in the morning so 8 am to [9 am] (time) can work for me",
  "Hey, I would to [taper] (haircut_style) the side on monday. Can you create an appointment for me please. I am free in the morning so 8 am to 9 am can work for me",
  "Hey, I would to taper the side on [monday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 8 am to 9 am can work for me",
  "Hey, I would to taper the side on monday. Can you create an appointment for me please. I am free in the [morning] (time) so 8 am to 9 am can work for me",
  "Hey, I would to taper the side on monday. Can you create an appointment for me please. I am free in the morning so 8 am to [9 am] (time) can work for me",
  "Hey, I would to taper the side on monday. Can you create an appointment for me please. I am free in the morning so [8 am] (time) to 9 am can work for me",
  "Please create an appointment next week [monday] (dayofweek) at 8 pm for me. I have to fix my taper and take a fade.",
  "Please create an appointment next week monday at [8 pm] (time) for me. I have to fix my taper and take a fade.",
  "Please create an appointment next week monday at 8 pm for me. I have to fix my [taper] (haircut_style) and take a fade.",
  "Please create an appointment next week monday at 8 pm for me. I have to fix my taper and take a [fade] (haircut_style).",
  "I would like a [taper] (haircut_style) at 8:00 pm on monday",
  "I would like a taper at [8:00 pm] (time) on monday",
  "I would like a taper at 8:00 pm on [monday] (dayofweek)",
  "I would like a [fade] (haircut_style) at 9:30 pm",
  "I would like a fade at [9:30 pm] (time)",
  "I just need a [fade] (haircut_style) on tuesday at 9 pm",
  "I just need a fade on [tuesday] (dayofweek) at 9 pm",
  "I just need a fade on tuesday at [9 pm] (time)",
  "I need a [fade] (haircut_style) at 9:30 pm on tuesday",
  "I need a fade at [9:30 pm] (time) on tuesday",
  "I need a fade at 9:30 pm on [tuesday] (dayofweek)",
  "I am thinking about a [fade] (haircut_style). I would like to cut on tuesday at 9 O'clock",
  "I am thinking about a fade. I would like to cut on [tuesday] (dayofweek) at 9 O'clock",
  "I am thinking about a fade. I would like to cut on tuesday at [9 O'clock] (time)",
  "I am thinking about a [fade] (haircut_style). I would like to cut on tuesday at 9 O'clock",
  "I am thinking about a fade. I would like to cut on [tuesday] (dayofweek) at 9 O'clock",
  "I am thinking about a fade. I would like to cut on tuesday at [9 O'clock] (time)",
  "I am thinking about a [fade] (haircut_style). I would like to cut on tuesday at 9 O'clock",
  "I am thinking about a fade. I would like to cut on [tuesday] (dayofweek) at 9 O'clock",
  "I am thinking about a fade. I would like to cut on tuesday at [9 O'clock] (time)",
  "I will go with a [fade] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like tuesday at 9:30 pm",
  "I will go with a fade. My girlfriend really like that. Can we do it as soon as possible like [tuesday] (dayofweek) at 9:30 pm",
  "I will go with a fade. My girlfriend really like that. Can we do it as soon as possible like tuesday at [9:30 pm] (time)",
  "I will go with a [fade] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like tuesday at 9:30 pm",
  "I will go with a fade. My girlfriend really like that. Can we do it as soon as possible like [tuesday] (dayofweek) at 9:30 pm",
  "I will go with a fade. My girlfriend really like that. Can we do it as soon as possible like tuesday at [9:30 pm] (time)",
  "I will go with a [fade] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like tuesday at 9:30 pm",
  "I will go with a fade. My girlfriend really like that. Can we do it as soon as possible like [tuesday] (dayofweek) at 9:30 pm",
  "I will go with a fade. My girlfriend really like that. Can we do it as soon as possible like tuesday at [9:30 pm] (time)",
  "i am looking for something funny like a [fade] (haircut_style). Can we do it at 9 O'clock on tuesday.",
  "i am looking for something funny like a fade. Can we do it at [9 O'clock] (time) on tuesday.",
  "i am looking for something funny like a fade. Can we do it at 9 O'clock on [tuesday] (dayofweek).",
  "Hey, please create an appointment to cut my hair on [tuesday] (dayofweek) around 9 O'clock in the morning. I just need a fade",
  "Hey, please create an appointment to cut my hair on tuesday around [9 O'clock in the morning] (time). I just need a fade",
  "Hey, please create an appointment to cut my hair on tuesday around 9 O'clock in the morning. I just need a [fade] (haircut_style)",
  "my son needs a hair cut. He will be taking the usually cut, a [fade] (haircut_style). Same time as well, tuesday at 9 pm. If 9 pm is not available, i can do 9 pm",
  "my son needs a hair cut. He will be taking the usually cut, a fade. Same time as well, [tuesday] (dayofweek) at 9 pm. If 9 pm is not available, i can do 9 pm",
  "my son needs a hair cut. He will be taking the usually cut, a fade. Same time as well, tuesday at [9 pm] (time). If [9 pm] (time) is not available, i can do [9 pm] (time)",
  "my son needs a hair cut. He will be taking the usually cut, a fade. Same time as well, tuesday at [9 pm] (time). If [9 pm] (time) is not available, i can do [9 pm] (time)",
  "I need a [fade] (haircut_style) before tuesday. Anytime in the afternoon like 9:30 pm is good",
  "I need a fade before [tuesday] (dayofweek). Anytime in the afternoon like 9:30 pm is good",
  "I need a fade before tuesday. Anytime in the [afternoon] (time) like 9:30 pm is good",
  "I need a fade before tuesday. Anytime in the afternoon like [9:30 pm] (time) is good",
  "My son need a haircut at [ 9 pm] (time) tomorrow. He will be taking the usual a fade",
  "My son need a haircut at  9 pm [tomorrow] (dayofweek). He will be taking the usual a fade",
  "My son need a haircut at  9 pm tomorrow. He will be taking the usual a [fade] (haircut_style)",
  "my hair needs to cut. When is the earliest i can have a [fade] (haircut_style). I am only available in the morning",
  "my hair needs to cut. When is the [earliest] (dayofweek) i can have a fade. I am only available in the morning",
  "my hair needs to cut. When is the earliest i can have a fade. I am only available in the [morning] (time)",
  "[Next week] (dayofweek) tuesday the 9 i need fade. Anytime is good for me, but I prefer the afternoon",
  "Next week [tuesday] (dayofweek) the 9 i need fade. Anytime is good for me, but I prefer the afternoon",
  "Next week tuesday the 9 i need [fade] (haircut_style). Anytime is good for me, but I prefer the afternoon",
  "Next week tuesday the 9 i need fade. Anytime is good for me, but I prefer the [afternoon] (time)",
  "Next week tuesday the 9 i need fade. [Anytime] (time) is good for me, but I prefer the afternoon",
  "[9 pm] (time) on tuesday is fine",
  "9 pm on [tuesday] (dayofweek) is fine",
  "I would like a [fade] (haircut_style) at 9:00 pm on tuesday",
  "I would like a fade at [9:00 pm] (time) on tuesday",
  "I would like a fade at 9:00 pm on [tuesday] (dayofweek)",
  "Please create an appointment next week [tuesday] (dayofweek) at 9 pm for me. I want to take a taper and a fade.",
  "Please create an appointment next week tuesday at [9 pm] (time) for me. I want to take a taper and a fade.",
  "Please create an appointment next week tuesday at 9 pm for me. I want to take a [taper] (haircut_style) and a fade.",
  "Please create an appointment next week tuesday at 9 pm for me. I want to take a taper and a [fade] (haircut_style).",
  "my hair needs a trim. When is the earliest i can have a [fade] (haircut_style). I am only available in the morning on tuesday",
  "my hair needs a trim. When is the earliest i can have a fade. I am only available in the morning on [tuesday] (dayofweek)",
  "I would like a [fade] (haircut_style) at 9 pm on tuesday",
  "I would like a fade at [9 pm] (time) on tuesday",
  "I would like a fade at 9 pm on [tuesday] (dayofweek)",
  "I just need a [fade] (haircut_style) on tuesday at 9 pm",
  "I just need a fade on [tuesday] (dayofweek) at 9 pm",
  "I just need a fade on tuesday at [9 pm] (time)",
  "My son need a haircut_style at  [9 pm] (time) tomorrow. He will be taking the usual fade on tuesday",
  "My son need a haircut_style at  9 pm tomorrow. He will be taking the usual [fade] (haircut_style) on tuesday",
  "My son need a haircut_style at  9 pm tomorrow. He will be taking the usual fade on [tuesday] (dayofweek)",
  "i want [fade] (haircut_style). tuesday is a good day to cut my hair at 9 pm",
  "i want fade. [tuesday] (dayofweek) is a good day to cut my hair at 9 pm",
  "i want fade. tuesday is a good day to cut my hair at [9 pm] (time)",
  "The day i want to cut my hair is [tuesday] (dayofweek). I need a fade at 9 pm",
  "The day i want to cut my hair is tuesday. I need a [fade] (haircut_style) at 9 pm",
  "The day i want to cut my hair is tuesday. I need a fade at [9 pm] (time)",
  "I am free [tuesday] (dayofweek) and i am looking for a haircut. I am thinking about a fade. The time i want to cut it is 9 pm",
  "I am free tuesday and i am looking for a haircut. I am thinking about a [fade] (haircut_style). The time i want to cut it is 9 pm",
  "I am free tuesday and i am looking for a haircut. I am thinking about a fade. The time i want to cut it is [9 pm] (time)",
  "[tuesday] (dayofweek) is a good day to cut my hair. I want a fade at 9 pm",
  "tuesday is a good day to cut my hair. I want a [fade] (haircut_style) at 9 pm",
  "tuesday is a good day to cut my hair. I want a fade at [9 pm] (time)",
  "Next week [tuesday] (dayofweek) i want to get a fade at 9 pm",
  "Next week tuesday i want to get a [fade] (haircut_style) at 9 pm",
  "Next week tuesday i want to get a fade at [9 pm] (time)",
  "On [tuesday] (dayofweek) 13. I want to get a fade at 9 pm",
  "On tuesday 13. I want to get a [fade] (haircut_style) at 9 pm",
  "On tuesday 13. I want to get a fade at [9 pm] (time)",
  "I will take a [fade] (haircut_style) tuesday at 9 pm",
  "I will take a fade [tuesday] (dayofweek) at 9 pm",
  "I will take a fade tuesday at [9 pm] (time)",
  "I am going to the barber on [tuesday] (dayofweek) at 9 pm for a fade",
  "I am going to the barber on tuesday at [9 pm] (time) for a fade",
  "I am going to the barber on tuesday at 9 pm for a [fade] (haircut_style)",
  "[tuesday] (dayofweek) coming is when i will take a fade. The time i am free is 9 pm",
  "tuesday coming is when i will take a [fade] (haircut_style). The time i am free is 9 pm",
  "tuesday coming is when i will take a fade. The time i am free is [9 pm] (time)",
  "[tuesday] (dayofweek) is a good day",
  "i would like a [fade] (haircut_style) hairstyle",
  "I am free on [tuesday] (dayofweek)",
  "[tuesday] (dayofweek) can work for me",
  "i need a [fade] (haircut_style) haircut",
  "I need a trim and a [fade] (haircut_style) tomorrow at 9 pm. If it's not available next tuesday in the afternoon around 9",
  "I need a trim and a fade tomorrow at [9 pm] (time). If it's not available next tuesday in the afternoon around 9",
  "I need a trim and a fade tomorrow at 9 pm. If it's not available next [tuesday] (dayofweek) in the afternoon around 9",
  "I need a trim and a fade tomorrow at 9 pm. If it's not available next tuesday in the [afternoon] (time) around 9",
  "Can you give me a [fade] (haircut_style) or taper. I can go for tuesday or wednesday around 9 in the morning",
  "Can you give me a fade or [taper] (haircut_style). I can go for tuesday or wednesday around 9 in the morning",
  "Can you give me a fade or taper. I can go for [tuesday] (dayofweek) or wednesday around 9 in the morning",
  "Can you give me a fade or taper. I can go for tuesday or [wednesday] (dayofweek) around 9 in the morning",
  "Can you give me a fade or taper. I can go for tuesday or wednesday around 9 in the [morning] (time)",
  "I just want a [fade] (haircut_style), nothing too fancy. will tomorrow around 9 in the afternoon work",
  "I just want a fade, nothing too fancy. will [tomorrow] (dayofweek) around 9 in the afternoon work",
  "I just want a fade, nothing too fancy. will tomorrow around 9 in the [afternoon] (time) work",
  "i am looking for something different like a [fade] (haircut_style) or a taper. Anytime around 9 O'clock is fine on tuesday.",
  "i am looking for something different like a fade or a [taper] (haircut_style). Anytime around 9 O'clock is fine on tuesday.",
  "i am looking for something different like a fade or a taper. Anytime around [9 O'clock] (time) is fine on tuesday.",
  "i am looking for something different like a fade or a taper. Anytime around 9 O'clock is fine on [tuesday] (dayofweek).",
  "can i have a [fade] (haircut_style) on tuesday in the morning at 9 or 9 am?",
  "can i have a fade on [tuesday] (dayofweek) in the morning at 9 or 9 am?",
  "can i have a fade on tuesday in the [morning] (time) at 9 or 9 am?",
  "can i have a fade on tuesday in the morning at 9 or [9 am] (time)?",
  "Hey, I would a [fade] (haircut_style) on tuesday. Can you create an appointment for me please. I am free in the morning so 9 am to 10 am can work for me",
  "Hey, I would a fade on [tuesday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 9 am to 10 am can work for me",
  "Hey, I would a fade on tuesday. Can you create an appointment for me please. I am free in the morning so [9 am] (time) to 10 am can work for me",
  "Hey, I would a fade on tuesday. Can you create an appointment for me please. I am free in the morning so 9 am to [10 am] (time) can work for me",
  "Hey, I would to [fade] (haircut_style) the side on tuesday. Can you create an appointment for me please. I am free in the morning so 9 am to 10 am can work for me",
  "Hey, I would to fade the side on [tuesday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 9 am to 10 am can work for me",
  "Hey, I would to fade the side on tuesday. Can you create an appointment for me please. I am free in the [morning] (time) so 9 am to 10 am can work for me",
  "Hey, I would to fade the side on tuesday. Can you create an appointment for me please. I am free in the morning so 9 am to [10 am] (time) can work for me",
  "Hey, I would to fade the side on tuesday. Can you create an appointment for me please. I am free in the morning so [9 am] (time) to 10 am can work for me",
  "Please create an appointment next week [tuesday] (dayofweek) at 9 pm for me. I have to fix my fade and take a taper.",
  "Please create an appointment next week tuesday at [9 pm] (time) for me. I have to fix my fade and take a taper.",
  "Please create an appointment next week tuesday at 9 pm for me. I have to fix my [fade] (haircut_style) and take a taper.",
  "Please create an appointment next week tuesday at 9 pm for me. I have to fix my fade and take a [taper] (haircut_style).",
  "I would like a [fade] (haircut_style) at 9:00 pm on tuesday",
  "I would like a fade at [9:00 pm] (time) on tuesday",
  "I would like a fade at 9:00 pm on [tuesday] (dayofweek)",
  "I would like a [slick back] (haircut_style) at 10:30 pm",
  "I would like a slick back at [10:30 pm] (time)",
  "I just need a [slick back] (haircut_style) on wednesday at 10 pm",
  "I just need a slick back on [wednesday] (dayofweek) at 10 pm",
  "I just need a slick back on wednesday at [10 pm] (time)",
  "I need a [slick back] (haircut_style) at 10:30 pm on wednesday",
  "I need a slick back at [10:30 pm] (time) on wednesday",
  "I need a slick back at 10:30 pm on [wednesday] (dayofweek)",
  "I am thinking about a [slick back] (haircut_style). I would like to cut on wednesday at 10 O'clock",
  "I am thinking about a slick back. I would like to cut on [wednesday] (dayofweek) at 10 O'clock",
  "I am thinking about a slick back. I would like to cut on wednesday at [10 O'clock] (time)",
  "I am thinking about a [slick back] (haircut_style). I would like to cut on wednesday at 10 O'clock",
  "I am thinking about a slick back. I would like to cut on [wednesday] (dayofweek) at 10 O'clock",
  "I am thinking about a slick back. I would like to cut on wednesday at [10 O'clock] (time)",
  "I am thinking about a [slick back] (haircut_style). I would like to cut on wednesday at 10 O'clock",
  "I am thinking about a slick back. I would like to cut on [wednesday] (dayofweek) at 10 O'clock",
  "I am thinking about a slick back. I would like to cut on wednesday at [10 O'clock] (time)",
  "I will go with a [slick back] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like wednesday at 10:30 pm",
  "I will go with a slick back. My girlfriend really like that. Can we do it as soon as possible like [wednesday] (dayofweek) at 10:30 pm",
  "I will go with a slick back. My girlfriend really like that. Can we do it as soon as possible like wednesday at [10:30 pm] (time)",
  "I will go with a [slick back] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like wednesday at 10:30 pm",
  "I will go with a slick back. My girlfriend really like that. Can we do it as soon as possible like [wednesday] (dayofweek) at 10:30 pm",
  "I will go with a slick back. My girlfriend really like that. Can we do it as soon as possible like wednesday at [10:30 pm] (time)",
  "I will go with a [slick back] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like wednesday at 10:30 pm",
  "I will go with a slick back. My girlfriend really like that. Can we do it as soon as possible like [wednesday] (dayofweek) at 10:30 pm",
  "I will go with a slick back. My girlfriend really like that. Can we do it as soon as possible like wednesday at [10:30 pm] (time)",
  "i am looking for something funny like a [slick back] (haircut_style). Can we do it at 10 O'clock on wednesday.",
  "i am looking for something funny like a slick back. Can we do it at [10 O'clock] (time) on wednesday.",
  "i am looking for something funny like a slick back. Can we do it at 10 O'clock on [wednesday] (dayofweek).",
  "Hey, please create an appointment to cut my hair on [wednesday] (dayofweek) around 10 O'clock in the morning. I just need a slick back",
  "Hey, please create an appointment to cut my hair on wednesday around [10 O'clock in the morning] (time). I just need a slick back",
  "Hey, please create an appointment to cut my hair on wednesday around 10 O'clock in the morning. I just need a [slick back] (haircut_style)",
  "my son needs a hair cut. He will be taking the usually cut, a [slick back] (haircut_style). Same time as well, wednesday at 10 pm. If 10 pm is not available, i can do 10 pm",
  "my son needs a hair cut. He will be taking the usually cut, a slick back. Same time as well, [wednesday] (dayofweek) at 10 pm. If 10 pm is not available, i can do 10 pm",
  "my son needs a hair cut. He will be taking the usually cut, a slick back. Same time as well, wednesday at [10 pm] (time). If [10 pm] (time) is not available, i can do [10 pm] (time)",
  "my son needs a hair cut. He will be taking the usually cut, a slick back. Same time as well, wednesday at [10 pm] (time). If [10 pm] (time) is not available, i can do [10 pm] (time)",
  "I need a [slick back] (haircut_style) before wednesday. Anytime in the afternoon like 10:30 pm is good",
  "I need a slick back before [wednesday] (dayofweek). Anytime in the afternoon like 10:30 pm is good",
  "I need a slick back before wednesday. Anytime in the [afternoon] (time) like 10:30 pm is good",
  "I need a slick back before wednesday. Anytime in the afternoon like [10:30 pm] (time) is good",
  "My son need a haircut at [ 10 pm] (time) tomorrow. He will be taking the usual a slick back",
  "My son need a haircut at  10 pm [tomorrow] (dayofweek). He will be taking the usual a slick back",
  "My son need a haircut at  10 pm tomorrow. He will be taking the usual a [slick back] (haircut_style)",
  "my hair needs to cut. When is the earliest i can have a [slick back] (haircut_style). I am only available in the morning",
  "my hair needs to cut. When is the [earliest] (dayofweek) i can have a slick back. I am only available in the morning",
  "my hair needs to cut. When is the earliest i can have a slick back. I am only available in the [morning] (time)",
  "[Next week] (dayofweek) wednesday the 10 i need slick back. Anytime is good for me, but I prefer the afternoon",
  "Next week [wednesday] (dayofweek) the 10 i need slick back. Anytime is good for me, but I prefer the afternoon",
  "Next week wednesday the 10 i need [slick back] (haircut_style). Anytime is good for me, but I prefer the afternoon",
  "Next week wednesday the 10 i need slick back. Anytime is good for me, but I prefer the [afternoon] (time)",
  "Next week wednesday the 10 i need slick back. [Anytime] (time) is good for me, but I prefer the afternoon",
  "[10 pm] (time) on wednesday is fine",
  "10 pm on [wednesday] (dayofweek) is fine",
  "I would like a [slick back] (haircut_style) at 10:00 pm on wednesday",
  "I would like a slick back at [10:00 pm] (time) on wednesday",
  "I would like a slick back at 10:00 pm on [wednesday] (dayofweek)",
  "Please create an appointment next week [wednesday] (dayofweek) at 10 pm for me. I want to take a taper and a slick back.",
  "Please create an appointment next week wednesday at [10 pm] (time) for me. I want to take a taper and a slick back.",
  "Please create an appointment next week wednesday at 10 pm for me. I want to take a [taper] (haircut_style) and a slick back.",
  "Please create an appointment next week wednesday at 10 pm for me. I want to take a taper and a [slick back] (haircut_style).",
  "my hair needs a trim. When is the earliest i can have a [slick back] (haircut_style). I am only available in the morning on wednesday",
  "my hair needs a trim. When is the earliest i can have a slick back. I am only available in the morning on [wednesday] (dayofweek)",
  "I would like a [slick back] (haircut_style) at 10 pm on wednesday",
  "I would like a slick back at [10 pm] (time) on wednesday",
  "I would like a slick back at 10 pm on [wednesday] (dayofweek)",
  "I just need a [slick back] (haircut_style) on wednesday at 10 pm",
  "I just need a slick back on [wednesday] (dayofweek) at 10 pm",
  "I just need a slick back on wednesday at [10 pm] (time)",
  "My son need a haircut_style at  [10 pm] (time) tomorrow. He will be taking the usual slick back on wednesday",
  "My son need a haircut_style at  10 pm tomorrow. He will be taking the usual [slick back] (haircut_style) on wednesday",
  "My son need a haircut_style at  10 pm tomorrow. He will be taking the usual slick back on [wednesday] (dayofweek)",
  "i want [slick back] (haircut_style). wednesday is a good day to cut my hair at 10 pm",
  "i want slick back. [wednesday] (dayofweek) is a good day to cut my hair at 10 pm",
  "i want slick back. wednesday is a good day to cut my hair at [10 pm] (time)",
  "The day i want to cut my hair is [wednesday] (dayofweek). I need a slick back at 10 pm",
  "The day i want to cut my hair is wednesday. I need a [slick back] (haircut_style) at 10 pm",
  "The day i want to cut my hair is wednesday. I need a slick back at [10 pm] (time)",
  "I am free [wednesday] (dayofweek) and i am looking for a haircut. I am thinking about a slick back. The time i want to cut it is 10 pm",
  "I am free wednesday and i am looking for a haircut. I am thinking about a [slick back] (haircut_style). The time i want to cut it is 10 pm",
  "I am free wednesday and i am looking for a haircut. I am thinking about a slick back. The time i want to cut it is [10 pm] (time)",
  "[wednesday] (dayofweek) is a good day to cut my hair. I want a slick back at 10 pm",
  "wednesday is a good day to cut my hair. I want a [slick back] (haircut_style) at 10 pm",
  "wednesday is a good day to cut my hair. I want a slick back at [10 pm] (time)",
  "Next week [wednesday] (dayofweek) i want to get a slick back at 10 pm",
  "Next week wednesday i want to get a [slick back] (haircut_style) at 10 pm",
  "Next week wednesday i want to get a slick back at [10 pm] (time)",
  "On [wednesday] (dayofweek) 13. I want to get a slick back at 10 pm",
  "On wednesday 13. I want to get a [slick back] (haircut_style) at 10 pm",
  "On wednesday 13. I want to get a slick back at [10 pm] (time)",
  "I will take a [slick back] (haircut_style) wednesday at 10 pm",
  "I will take a slick back [wednesday] (dayofweek) at 10 pm",
  "I will take a slick back wednesday at [10 pm] (time)",
  "I am going to the barber on [wednesday] (dayofweek) at 10 pm for a slick back",
  "I am going to the barber on wednesday at [10 pm] (time) for a slick back",
  "I am going to the barber on wednesday at 10 pm for a [slick back] (haircut_style)",
  "[wednesday] (dayofweek) coming is when i will take a slick back. The time i am free is 10 pm",
  "wednesday coming is when i will take a [slick back] (haircut_style). The time i am free is 10 pm",
  "wednesday coming is when i will take a slick back. The time i am free is [10 pm] (time)",
  "[wednesday] (dayofweek) is a good day",
  "i would like a [slick back] (haircut_style) hairstyle",
  "I am free on [wednesday] (dayofweek)",
  "[wednesday] (dayofweek) can work for me",
  "i need a [slick back] (haircut_style) haircut",
  "I need a trim and a [slick back] (haircut_style) tomorrow at 10 pm. If it's not available next wednesday in the afternoon around 10",
  "I need a trim and a slick back tomorrow at [10 pm] (time). If it's not available next wednesday in the afternoon around 10",
  "I need a trim and a slick back tomorrow at 10 pm. If it's not available next [wednesday] (dayofweek) in the afternoon around 10",
  "I need a trim and a slick back tomorrow at 10 pm. If it's not available next wednesday in the [afternoon] (time) around 10",
  "Can you give me a [slick back] (haircut_style) or taper. I can go for wednesday or thursday around 10 in the morning",
  "Can you give me a slick back or [taper] (haircut_style). I can go for wednesday or thursday around 10 in the morning",
  "Can you give me a slick back or taper. I can go for [wednesday] (dayofweek) or thursday around 10 in the morning",
  "Can you give me a slick back or taper. I can go for wednesday or [thursday] (dayofweek) around 10 in the morning",
  "Can you give me a slick back or taper. I can go for wednesday or thursday around 10 in the [morning] (time)",
  "I just want a [slick back] (haircut_style), nothing too fancy. will tomorrow around 10 in the afternoon work",
  "I just want a slick back, nothing too fancy. will [tomorrow] (dayofweek) around 10 in the afternoon work",
  "I just want a slick back, nothing too fancy. will tomorrow around 10 in the [afternoon] (time) work",
  "i am looking for something different like a [slick back] (haircut_style) or a taper. Anytime around 10 O'clock is fine on wednesday.",
  "i am looking for something different like a slick back or a [taper] (haircut_style). Anytime around 10 O'clock is fine on wednesday.",
  "i am looking for something different like a slick back or a taper. Anytime around [10 O'clock] (time) is fine on wednesday.",
  "i am looking for something different like a slick back or a taper. Anytime around 10 O'clock is fine on [wednesday] (dayofweek).",
  "can i have a [slick back] (haircut_style) on wednesday in the morning at 10 or 10 am?",
  "can i have a slick back on [wednesday] (dayofweek) in the morning at 10 or 10 am?",
  "can i have a slick back on wednesday in the [morning] (time) at 10 or 10 am?",
  "can i have a slick back on wednesday in the morning at 10 or [10 am] (time)?",
  "Hey, I would a [slick back] (haircut_style) on wednesday. Can you create an appointment for me please. I am free in the morning so 10 am to 11 am can work for me",
  "Hey, I would a slick back on [wednesday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 10 am to 11 am can work for me",
  "Hey, I would a slick back on wednesday. Can you create an appointment for me please. I am free in the morning so [10 am] (time) to 11 am can work for me",
  "Hey, I would a slick back on wednesday. Can you create an appointment for me please. I am free in the morning so 10 am to [11 am] (time) can work for me",
  "Hey, I would to [slick back] (haircut_style) the side on wednesday. Can you create an appointment for me please. I am free in the morning so 10 am to 11 am can work for me",
  "Hey, I would to slick back the side on [wednesday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 10 am to 11 am can work for me",
  "Hey, I would to slick back the side on wednesday. Can you create an appointment for me please. I am free in the [morning] (time) so 10 am to 11 am can work for me",
  "Hey, I would to slick back the side on wednesday. Can you create an appointment for me please. I am free in the morning so 10 am to [11 am] (time) can work for me",
  "Hey, I would to slick back the side on wednesday. Can you create an appointment for me please. I am free in the morning so [10 am] (time) to 11 am can work for me",
  "Please create an appointment next week [wednesday] (dayofweek) at 10 pm for me. I have to fix my slick back and take a taper.",
  "Please create an appointment next week wednesday at [10 pm] (time) for me. I have to fix my slick back and take a taper.",
  "Please create an appointment next week wednesday at 10 pm for me. I have to fix my [slick back] (haircut_style) and take a taper.",
  "Please create an appointment next week wednesday at 10 pm for me. I have to fix my slick back and take a [taper] (haircut_style).",
  "I would like a [slick back] (haircut_style) at 10:00 pm on wednesday",
  "I would like a slick back at [10:00 pm] (time) on wednesday",
  "I would like a slick back at 10:00 pm on [wednesday] (dayofweek)",
  "I would like a [buzz cut] (haircut_style) at 11:30 pm",
  "I would like a buzz cut at [11:30 pm] (time)",
  "I just need a [buzz cut] (haircut_style) on thursday at 11 pm",
  "I just need a buzz cut on [thursday] (dayofweek) at 11 pm",
  "I just need a buzz cut on thursday at [11 pm] (time)",
  "I need a [buzz cut] (haircut_style) at 11:30 pm on thursday",
  "I need a buzz cut at [11:30 pm] (time) on thursday",
  "I need a buzz cut at 11:30 pm on [thursday] (dayofweek)",
  "I am thinking about a [buzz cut] (haircut_style). I would like to cut on thursday at 11 O'clock",
  "I am thinking about a buzz cut. I would like to cut on [thursday] (dayofweek) at 11 O'clock",
  "I am thinking about a buzz cut. I would like to cut on thursday at [11 O'clock] (time)",
  "I am thinking about a [buzz cut] (haircut_style). I would like to cut on thursday at 11 O'clock",
  "I am thinking about a buzz cut. I would like to cut on [thursday] (dayofweek) at 11 O'clock",
  "I am thinking about a buzz cut. I would like to cut on thursday at [11 O'clock] (time)",
  "I am thinking about a [buzz cut] (haircut_style). I would like to cut on thursday at 11 O'clock",
  "I am thinking about a buzz cut. I would like to cut on [thursday] (dayofweek) at 11 O'clock",
  "I am thinking about a buzz cut. I would like to cut on thursday at [11 O'clock] (time)",
  "I will go with a [buzz cut] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like thursday at 11:30 pm",
  "I will go with a buzz cut. My girlfriend really like that. Can we do it as soon as possible like [thursday] (dayofweek) at 11:30 pm",
  "I will go with a buzz cut. My girlfriend really like that. Can we do it as soon as possible like thursday at [11:30 pm] (time)",
  "I will go with a [buzz cut] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like thursday at 11:30 pm",
  "I will go with a buzz cut. My girlfriend really like that. Can we do it as soon as possible like [thursday] (dayofweek) at 11:30 pm",
  "I will go with a buzz cut. My girlfriend really like that. Can we do it as soon as possible like thursday at [11:30 pm] (time)",
  "I will go with a [buzz cut] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like thursday at 11:30 pm",
  "I will go with a buzz cut. My girlfriend really like that. Can we do it as soon as possible like [thursday] (dayofweek) at 11:30 pm",
  "I will go with a buzz cut. My girlfriend really like that. Can we do it as soon as possible like thursday at [11:30 pm] (time)",
  "i am looking for something funny like a [buzz cut] (haircut_style). Can we do it at 11 O'clock on thursday.",
  "i am looking for something funny like a buzz cut. Can we do it at [11 O'clock] (time) on thursday.",
  "i am looking for something funny like a buzz cut. Can we do it at 11 O'clock on [thursday] (dayofweek).",
  "Hey, please create an appointment to cut my hair on [thursday] (dayofweek) around 11 O'clock in the morning. I just need a buzz cut",
  "Hey, please create an appointment to cut my hair on thursday around [11 O'clock in the morning] (time). I just need a buzz cut",
  "Hey, please create an appointment to cut my hair on thursday around 11 O'clock in the morning. I just need a [buzz cut] (haircut_style)",
  "my son needs a hair cut. He will be taking the usually cut, a [buzz cut] (haircut_style). Same time as well, thursday at 11 pm. If 11 pm is not available, i can do 11 pm",
  "my son needs a hair cut. He will be taking the usually cut, a buzz cut. Same time as well, [thursday] (dayofweek) at 11 pm. If 11 pm is not available, i can do 11 pm",
  "my son needs a hair cut. He will be taking the usually cut, a buzz cut. Same time as well, thursday at [11 pm] (time). If [11 pm] (time) is not available, i can do [11 pm] (time)",
  "my son needs a hair cut. He will be taking the usually cut, a buzz cut. Same time as well, thursday at [11 pm] (time). If [11 pm] (time) is not available, i can do [11 pm] (time)",
  "I need a [buzz cut] (haircut_style) before thursday. Anytime in the afternoon like 11:30 pm is good",
  "I need a buzz cut before [thursday] (dayofweek). Anytime in the afternoon like 11:30 pm is good",
  "I need a buzz cut before thursday. Anytime in the [afternoon] (time) like 11:30 pm is good",
  "I need a buzz cut before thursday. Anytime in the afternoon like [11:30 pm] (time) is good",
  "My son need a haircut at [ 11 pm] (time) tomorrow. He will be taking the usual a buzz cut",
  "My son need a haircut at  11 pm [tomorrow] (dayofweek). He will be taking the usual a buzz cut",
  "My son need a haircut at  11 pm tomorrow. He will be taking the usual a [buzz cut] (haircut_style)",
  "my hair needs to cut. When is the earliest i can have a [buzz cut] (haircut_style). I am only available in the morning",
  "my hair needs to cut. When is the [earliest] (dayofweek) i can have a buzz cut. I am only available in the morning",
  "my hair needs to cut. When is the earliest i can have a buzz cut. I am only available in the [morning] (time)",
  "[Next week] (dayofweek) thursday the 11 i need buzz cut. Anytime is good for me, but I prefer the afternoon",
  "Next week [thursday] (dayofweek) the 11 i need buzz cut. Anytime is good for me, but I prefer the afternoon",
  "Next week thursday the 11 i need [buzz cut] (haircut_style). Anytime is good for me, but I prefer the afternoon",
  "Next week thursday the 11 i need buzz cut. Anytime is good for me, but I prefer the [afternoon] (time)",
  "Next week thursday the 11 i need buzz cut. [Anytime] (time) is good for me, but I prefer the afternoon",
  "[11 pm] (time) on thursday is fine",
  "11 pm on [thursday] (dayofweek) is fine",
  "I would like a [buzz cut] (haircut_style) at 11:00 pm on thursday",
  "I would like a buzz cut at [11:00 pm] (time) on thursday",
  "I would like a buzz cut at 11:00 pm on [thursday] (dayofweek)",
  "Please create an appointment next week [thursday] (dayofweek) at 11 pm for me. I want to take a fade and a buzz cut.",
  "Please create an appointment next week thursday at [11 pm] (time) for me. I want to take a fade and a buzz cut.",
  "Please create an appointment next week thursday at 11 pm for me. I want to take a [fade] (haircut_style) and a buzz cut.",
  "Please create an appointment next week thursday at 11 pm for me. I want to take a fade and a [buzz cut] (haircut_style).",
  "my hair needs a trim. When is the earliest i can have a [buzz cut] (haircut_style). I am only available in the morning on thursday",
  "my hair needs a trim. When is the earliest i can have a buzz cut. I am only available in the morning on [thursday] (dayofweek)",
  "I would like a [buzz cut] (haircut_style) at 11 pm on thursday",
  "I would like a buzz cut at [11 pm] (time) on thursday",
  "I would like a buzz cut at 11 pm on [thursday] (dayofweek)",
  "I just need a [buzz cut] (haircut_style) on thursday at 11 pm",
  "I just need a buzz cut on [thursday] (dayofweek) at 11 pm",
  "I just need a buzz cut on thursday at [11 pm] (time)",
  "My son need a haircut_style at  [11 pm] (time) tomorrow. He will be taking the usual buzz cut on thursday",
  "My son need a haircut_style at  11 pm tomorrow. He will be taking the usual [buzz cut] (haircut_style) on thursday",
  "My son need a haircut_style at  11 pm tomorrow. He will be taking the usual buzz cut on [thursday] (dayofweek)",
  "i want [buzz cut] (haircut_style). thursday is a good day to cut my hair at 11 pm",
  "i want buzz cut. [thursday] (dayofweek) is a good day to cut my hair at 11 pm",
  "i want buzz cut. thursday is a good day to cut my hair at [11 pm] (time)",
  "The day i want to cut my hair is [thursday] (dayofweek). I need a buzz cut at 11 pm",
  "The day i want to cut my hair is thursday. I need a [buzz cut] (haircut_style) at 11 pm",
  "The day i want to cut my hair is thursday. I need a buzz cut at [11 pm] (time)",
  "I am free [thursday] (dayofweek) and i am looking for a haircut. I am thinking about a buzz cut. The time i want to cut it is 11 pm",
  "I am free thursday and i am looking for a haircut. I am thinking about a [buzz cut] (haircut_style). The time i want to cut it is 11 pm",
  "I am free thursday and i am looking for a haircut. I am thinking about a buzz cut. The time i want to cut it is [11 pm] (time)",
  "[thursday] (dayofweek) is a good day to cut my hair. I want a buzz cut at 11 pm",
  "thursday is a good day to cut my hair. I want a [buzz cut] (haircut_style) at 11 pm",
  "thursday is a good day to cut my hair. I want a buzz cut at [11 pm] (time)",
  "Next week [thursday] (dayofweek) i want to get a buzz cut at 11 pm",
  "Next week thursday i want to get a [buzz cut] (haircut_style) at 11 pm",
  "Next week thursday i want to get a buzz cut at [11 pm] (time)",
  "On [thursday] (dayofweek) 13. I want to get a buzz cut at 11 pm",
  "On thursday 13. I want to get a [buzz cut] (haircut_style) at 11 pm",
  "On thursday 13. I want to get a buzz cut at [11 pm] (time)",
  "I will take a [buzz cut] (haircut_style) thursday at 11 pm",
  "I will take a buzz cut [thursday] (dayofweek) at 11 pm",
  "I will take a buzz cut thursday at [11 pm] (time)",
  "I am going to the barber on [thursday] (dayofweek) at 11 pm for a buzz cut",
  "I am going to the barber on thursday at [11 pm] (time) for a buzz cut",
  "I am going to the barber on thursday at 11 pm for a [buzz cut] (haircut_style)",
  "[thursday] (dayofweek) coming is when i will take a buzz cut. The time i am free is 11 pm",
  "thursday coming is when i will take a [buzz cut] (haircut_style). The time i am free is 11 pm",
  "thursday coming is when i will take a buzz cut. The time i am free is [11 pm] (time)",
  "[thursday] (dayofweek) is a good day",
  "i would like a [buzz cut] (haircut_style) hairstyle",
  "I am free on [thursday] (dayofweek)",
  "[thursday] (dayofweek) can work for me",
  "i need a [buzz cut] (haircut_style) haircut",
  "I need a trim and a [buzz cut] (haircut_style) tomorrow at 11 pm. If it's not available next thursday in the afternoon around 11",
  "I need a trim and a buzz cut tomorrow at [11 pm] (time). If it's not available next thursday in the afternoon around 11",
  "I need a trim and a buzz cut tomorrow at 11 pm. If it's not available next [thursday] (dayofweek) in the afternoon around 11",
  "I need a trim and a buzz cut tomorrow at 11 pm. If it's not available next thursday in the [afternoon] (time) around 11",
  "Can you give me a [buzz cut] (haircut_style) or fade. I can go for thursday or friday around 11 in the morning",
  "Can you give me a buzz cut or [fade] (haircut_style). I can go for thursday or friday around 11 in the morning",
  "Can you give me a buzz cut or fade. I can go for [thursday] (dayofweek) or friday around 11 in the morning",
  "Can you give me a buzz cut or fade. I can go for thursday or [friday] (dayofweek) around 11 in the morning",
  "Can you give me a buzz cut or fade. I can go for thursday or friday around 11 in the [morning] (time)",
  "I just want a [buzz cut] (haircut_style), nothing too fancy. will tomorrow around 11 in the afternoon work",
  "I just want a buzz cut, nothing too fancy. will [tomorrow] (dayofweek) around 11 in the afternoon work",
  "I just want a buzz cut, nothing too fancy. will tomorrow around 11 in the [afternoon] (time) work",
  "i am looking for something different like a [buzz cut] (haircut_style) or a fade. Anytime around 11 O'clock is fine on thursday.",
  "i am looking for something different like a buzz cut or a [fade] (haircut_style). Anytime around 11 O'clock is fine on thursday.",
  "i am looking for something different like a buzz cut or a fade. Anytime around [11 O'clock] (time) is fine on thursday.",
  "i am looking for something different like a buzz cut or a fade. Anytime around 11 O'clock is fine on [thursday] (dayofweek).",
  "can i have a [buzz cut] (haircut_style) on thursday in the morning at 11 or 11 am?",
  "can i have a buzz cut on [thursday] (dayofweek) in the morning at 11 or 11 am?",
  "can i have a buzz cut on thursday in the [morning] (time) at 11 or 11 am?",
  "can i have a buzz cut on thursday in the morning at 11 or [11 am] (time)?",
  "Hey, I would a [buzz cut] (haircut_style) on thursday. Can you create an appointment for me please. I am free in the morning so 11 am to 12 am can work for me",
  "Hey, I would a buzz cut on [thursday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 11 am to 12 am can work for me",
  "Hey, I would a buzz cut on thursday. Can you create an appointment for me please. I am free in the morning so [11 am] (time) to 12 am can work for me",
  "Hey, I would a buzz cut on thursday. Can you create an appointment for me please. I am free in the morning so 11 am to [12 am] (time) can work for me",
  "Hey, I would to [buzz cut] (haircut_style) the side on thursday. Can you create an appointment for me please. I am free in the morning so 11 am to 12 am can work for me",
  "Hey, I would to buzz cut the side on [thursday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 11 am to 12 am can work for me",
  "Hey, I would to buzz cut the side on thursday. Can you create an appointment for me please. I am free in the [morning] (time) so 11 am to 12 am can work for me",
  "Hey, I would to buzz cut the side on thursday. Can you create an appointment for me please. I am free in the morning so 11 am to [12 am] (time) can work for me",
  "Hey, I would to buzz cut the side on thursday. Can you create an appointment for me please. I am free in the morning so [11 am] (time) to 12 am can work for me",
  "Please create an appointment next week [thursday] (dayofweek) at 11 pm for me. I have to fix my buzz cut and take a fade.",
  "Please create an appointment next week thursday at [11 pm] (time) for me. I have to fix my buzz cut and take a fade.",
  "Please create an appointment next week thursday at 11 pm for me. I have to fix my [buzz cut] (haircut_style) and take a fade.",
  "Please create an appointment next week thursday at 11 pm for me. I have to fix my buzz cut and take a [fade] (haircut_style).",
  "I would like a [buzz cut] (haircut_style) at 11:00 pm on thursday",
  "I would like a buzz cut at [11:00 pm] (time) on thursday",
  "I would like a buzz cut at 11:00 pm on [thursday] (dayofweek)",
  "I would like a [side part] (haircut_style) at 12:30 pm",
  "I would like a side part at [12:30 pm] (time)",
  "I just need a [side part] (haircut_style) on friday at 12 pm",
  "I just need a side part on [friday] (dayofweek) at 12 pm",
  "I just need a side part on friday at [12 pm] (time)",
  "I need a [side part] (haircut_style) at 12:30 pm on friday",
  "I need a side part at [12:30 pm] (time) on friday",
  "I need a side part at 12:30 pm on [friday] (dayofweek)",
  "I am thinking about a [side part] (haircut_style). I would like to cut on friday at 12 O'clock",
  "I am thinking about a side part. I would like to cut on [friday] (dayofweek) at 12 O'clock",
  "I am thinking about a side part. I would like to cut on friday at [12 O'clock] (time)",
  "I am thinking about a [side part] (haircut_style). I would like to cut on friday at 12 O'clock",
  "I am thinking about a side part. I would like to cut on [friday] (dayofweek) at 12 O'clock",
  "I am thinking about a side part. I would like to cut on friday at [12 O'clock] (time)",
  "I am thinking about a [side part] (haircut_style). I would like to cut on friday at 12 O'clock",
  "I am thinking about a side part. I would like to cut on [friday] (dayofweek) at 12 O'clock",
  "I am thinking about a side part. I would like to cut on friday at [12 O'clock] (time)",
  "I will go with a [side part] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like friday at 12:30 pm",
  "I will go with a side part. My girlfriend really like that. Can we do it as soon as possible like [friday] (dayofweek) at 12:30 pm",
  "I will go with a side part. My girlfriend really like that. Can we do it as soon as possible like friday at [12:30 pm] (time)",
  "I will go with a [side part] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like friday at 12:30 pm",
  "I will go with a side part. My girlfriend really like that. Can we do it as soon as possible like [friday] (dayofweek) at 12:30 pm",
  "I will go with a side part. My girlfriend really like that. Can we do it as soon as possible like friday at [12:30 pm] (time)",
  "I will go with a [side part] (haircut_style). My girlfriend really like that. Can we do it as soon as possible like friday at 12:30 pm",
  "I will go with a side part. My girlfriend really like that. Can we do it as soon as possible like [friday] (dayofweek) at 12:30 pm",
  "I will go with a side part. My girlfriend really like that. Can we do it as soon as possible like friday at [12:30 pm] (time)",
  "i am looking for something funny like a [side part] (haircut_style). Can we do it at 12 O'clock on friday.",
  "i am looking for something funny like a side part. Can we do it at [12 O'clock] (time) on friday.",
  "i am looking for something funny like a side part. Can we do it at 12 O'clock on [friday] (dayofweek).",
  "Hey, please create an appointment to cut my hair on [friday] (dayofweek) around 12 O'clock in the morning. I just need a side part",
  "Hey, please create an appointment to cut my hair on friday around [12 O'clock in the morning] (time). I just need a side part",
  "Hey, please create an appointment to cut my hair on friday around 12 O'clock in the morning. I just need a [side part] (haircut_style)",
  "my son needs a hair cut. He will be taking the usually cut, a [side part] (haircut_style). Same time as well, friday at 12 pm. If 12 pm is not available, i can do 12 pm",
  "my son needs a hair cut. He will be taking the usually cut, a side part. Same time as well, [friday] (dayofweek) at 12 pm. If 12 pm is not available, i can do 12 pm",
  "my son needs a hair cut. He will be taking the usually cut, a side part. Same time as well, friday at [12 pm] (time). If [12 pm] (time) is not available, i can do [12 pm] (time)",
  "my son needs a hair cut. He will be taking the usually cut, a side part. Same time as well, friday at [12 pm] (time). If [12 pm] (time) is not available, i can do [12 pm] (time)",
  "I need a [side part] (haircut_style) before friday. Anytime in the afternoon like 12:30 pm is good",
  "I need a side part before [friday] (dayofweek). Anytime in the afternoon like 12:30 pm is good",
  "I need a side part before friday. Anytime in the [afternoon] (time) like 12:30 pm is good",
  "I need a side part before friday. Anytime in the afternoon like [12:30 pm] (time) is good",
  "My son need a haircut at [ 12 pm] (time) tomorrow. He will be taking the usual a side part",
  "My son need a haircut at  12 pm [tomorrow] (dayofweek). He will be taking the usual a side part",
  "My son need a haircut at  12 pm tomorrow. He will be taking the usual a [side part] (haircut_style)",
  "my hair needs to cut. When is the earliest i can have a [side part] (haircut_style). I am only available in the morning",
  "my hair needs to cut. When is the [earliest] (dayofweek) i can have a side part. I am only available in the morning",
  "my hair needs to cut. When is the earliest i can have a side part. I am only available in the [morning] (time)",
  "[Next week] (dayofweek) friday the 12 i need side part. Anytime is good for me, but I prefer the afternoon",
  "Next week [friday] (dayofweek) the 12 i need side part. Anytime is good for me, but I prefer the afternoon",
  "Next week friday the 12 i need [side part] (haircut_style). Anytime is good for me, but I prefer the afternoon",
  "Next week friday the 12 i need side part. Anytime is good for me, but I prefer the [afternoon] (time)",
  "Next week friday the 12 i need side part. [Anytime] (time) is good for me, but I prefer the afternoon",
  "[12 pm] (time) on friday is fine",
  "12 pm on [friday] (dayofweek) is fine",
  "I would like a [side part] (haircut_style) at 12:00 pm on friday",
  "I would like a side part at [12:00 pm] (time) on friday",
  "I would like a side part at 12:00 pm on [friday] (dayofweek)",
  "Please create an appointment next week [friday] (dayofweek) at 12 pm for me. I want to take a fade and a side part.",
  "Please create an appointment next week friday at [12 pm] (time) for me. I want to take a fade and a side part.",
  "Please create an appointment next week friday at 12 pm for me. I want to take a [fade] (haircut_style) and a side part.",
  "Please create an appointment next week friday at 12 pm for me. I want to take a fade and a [side part] (haircut_style).",
  "my hair needs a trim. When is the earliest i can have a [side part] (haircut_style). I am only available in the morning on friday",
  "my hair needs a trim. When is the earliest i can have a side part. I am only available in the morning on [friday] (dayofweek)",
  "I would like a [side part] (haircut_style) at 12 pm on friday",
  "I would like a side part at [12 pm] (time) on friday",
  "I would like a side part at 12 pm on [friday] (dayofweek)",
  "I just need a [side part] (haircut_style) on friday at 12 pm",
  "I just need a side part on [friday] (dayofweek) at 12 pm",
  "I just need a side part on friday at [12 pm] (time)",
  "My son need a haircut_style at  [12 pm] (time) tomorrow. He will be taking the usual side part on friday",
  "My son need a haircut_style at  12 pm tomorrow. He will be taking the usual [side part] (haircut_style) on friday",
  "My son need a haircut_style at  12 pm tomorrow. He will be taking the usual side part on [friday] (dayofweek)",
  "i want [side part] (haircut_style). friday is a good day to cut my hair at 12 pm",
  "i want side part. [friday] (dayofweek) is a good day to cut my hair at 12 pm",
  "i want side part. friday is a good day to cut my hair at [12 pm] (time)",
  "The day i want to cut my hair is [friday] (dayofweek). I need a side part at 12 pm",
  "The day i want to cut my hair is friday. I need a [side part] (haircut_style) at 12 pm",
  "The day i want to cut my hair is friday. I need a side part at [12 pm] (time)",
  "I am free [friday] (dayofweek) and i am looking for a haircut. I am thinking about a side part. The time i want to cut it is 12 pm",
  "I am free friday and i am looking for a haircut. I am thinking about a [side part] (haircut_style). The time i want to cut it is 12 pm",
  "I am free friday and i am looking for a haircut. I am thinking about a side part. The time i want to cut it is [12 pm] (time)",
  "[friday] (dayofweek) is a good day to cut my hair. I want a side part at 12 pm",
  "friday is a good day to cut my hair. I want a [side part] (haircut_style) at 12 pm",
  "friday is a good day to cut my hair. I want a side part at [12 pm] (time)",
  "Next week [friday] (dayofweek) i want to get a side part at 12 pm",
  "Next week friday i want to get a [side part] (haircut_style) at 12 pm",
  "Next week friday i want to get a side part at [12 pm] (time)",
  "On [friday] (dayofweek) 13. I want to get a side part at 12 pm",
  "On friday 13. I want to get a [side part] (haircut_style) at 12 pm",
  "On friday 13. I want to get a side part at [12 pm] (time)",
  "I will take a [side part] (haircut_style) friday at 12 pm",
  "I will take a side part [friday] (dayofweek) at 12 pm",
  "I will take a side part friday at [12 pm] (time)",
  "I am going to the barber on [friday] (dayofweek) at 12 pm for a side part",
  "I am going to the barber on friday at [12 pm] (time) for a side part",
  "I am going to the barber on friday at 12 pm for a [side part] (haircut_style)",
  "[friday] (dayofweek) coming is when i will take a side part. The time i am free is 12 pm",
  "friday coming is when i will take a [side part] (haircut_style). The time i am free is 12 pm",
  "friday coming is when i will take a side part. The time i am free is [12 pm] (time)",
  "[friday] (dayofweek) is a good day",
  "i would like a [side part] (haircut_style) hairstyle",
  "I am free on [friday] (dayofweek)",
  "[friday] (dayofweek) can work for me",
  "i need a [side part] (haircut_style) haircut",
  "I need a trim and a [side part] (haircut_style) tomorrow at 12 pm. If it's not available next friday in the afternoon around 12",
  "I need a trim and a side part tomorrow at [12 pm] (time). If it's not available next friday in the afternoon around 12",
  "I need a trim and a side part tomorrow at 12 pm. If it's not available next [friday] (dayofweek) in the afternoon around 12",
  "I need a trim and a side part tomorrow at 12 pm. If it's not available next friday in the [afternoon] (time) around 12",
  "Can you give me a [side part] (haircut_style) or fade. I can go for friday or saturday around 12 in the morning",
  "Can you give me a side part or [fade] (haircut_style). I can go for friday or saturday around 12 in the morning",
  "Can you give me a side part or fade. I can go for [friday] (dayofweek) or saturday around 12 in the morning",
  "Can you give me a side part or fade. I can go for friday or [saturday] (dayofweek) around 12 in the morning",
  "Can you give me a side part or fade. I can go for friday or saturday around 12 in the [morning] (time)",
  "I just want a [side part] (haircut_style), nothing too fancy. will tomorrow around 12 in the afternoon work",
  "I just want a side part, nothing too fancy. will [tomorrow] (dayofweek) around 12 in the afternoon work",
  "I just want a side part, nothing too fancy. will tomorrow around 12 in the [afternoon] (time) work",
  "i am looking for something different like a [side part] (haircut_style) or a fade. Anytime around 12 O'clock is fine on friday.",
  "i am looking for something different like a side part or a [fade] (haircut_style). Anytime around 12 O'clock is fine on friday.",
  "i am looking for something different like a side part or a fade. Anytime around [12 O'clock] (time) is fine on friday.",
  "i am looking for something different like a side part or a fade. Anytime around 12 O'clock is fine on [friday] (dayofweek).",
  "can i have a [side part] (haircut_style) on friday in the morning at 12 or 12 am?",
  "can i have a side part on [friday] (dayofweek) in the morning at 12 or 12 am?",
  "can i have a side part on friday in the [morning] (time) at 12 or 12 am?",
  "can i have a side part on friday in the morning at 12 or [12 am] (time)?",
  "Hey, I would a [side part] (haircut_style) on friday. Can you create an appointment for me please. I am free in the morning so 12 am to 1 am can work for me",
  "Hey, I would a side part on [friday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 12 am to 1 am can work for me",
  "Hey, I would a side part on friday. Can you create an appointment for me please. I am free in the morning so [12 am] (time) to 1 am can work for me",
  "Hey, I would a side part on friday. Can you create an appointment for me please. I am free in the morning so 12 am to [1 am] (time) can work for me",
  "Hey, I would to [side part] (haircut_style) the side on friday. Can you create an appointment for me please. I am free in the morning so 12 am to 1 am can work for me",
  "Hey, I would to side part the side on [friday] (dayofweek). Can you create an appointment for me please. I am free in the morning so 12 am to 1 am can work for me",
  "Hey, I would to side part the side on friday. Can you create an appointment for me please. I am free in the [morning] (time) so 12 am to 1 am can work for me",
  "Hey, I would to side part the side on friday. Can you create an appointment for me please. I am free in the morning so 12 am to [1 am] (time) can work for me",
  "Hey, I would to side part the side on friday. Can you create an appointment for me please. I am free in the morning so [12 am] (time) to 1 am can work for me",
  "Please create an appointment next week [friday] (dayofweek) at 12 pm for me. I have to fix my side part and take a fade.",
  "Please create an appointment next week friday at [12 pm] (time) for me. I have to fix my side part and take a fade.",
  "Please create an appointment next week friday at 12 pm for me. I have to fix my [side part] (haircut_style) and take a fade.",
  "Please create an appointment next week friday at 12 pm for me. I have to fix my side part and take a [fade] (haircut_style).",
  "I would like a [side part] (haircut_style) at 12:00 pm on friday",
  "I would like a side part at [12:00 pm] (time) on friday",
  "I would like a side part at 12:00 pm on [friday] (dayofweek)"
]
